###################################################################

# Created by write_sdc on Mon Jun 5 18:07:18 2023

###################################################################
set sdc_version 1.7

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_operating_conditions -max slow -max_library stdcells-wc.db:NangateOpenCellLibrary -min fast -min_library stdcells-bc.db:NangateOpenCellLibrary
set_max_fanout 32 [current_design]
set_max_transition 1 [current_design]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[7]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[6]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[5]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[4]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[3]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[2]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[1]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[0]}]
set_load -pin_load 24.6946 [get_ports dmem_csb_write_o]
set_load -pin_load 24.6946 [get_ports {dmem_wmask_o[3]}]
set_load -pin_load 24.6946 [get_ports {dmem_wmask_o[2]}]
set_load -pin_load 24.6946 [get_ports {dmem_wmask_o[1]}]
set_load -pin_load 24.6946 [get_ports {dmem_wmask_o[0]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[7]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[6]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[5]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[4]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[3]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[2]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[1]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[0]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[31]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[30]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[29]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[28]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[27]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[26]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[25]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[24]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[23]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[22]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[21]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[20]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[19]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[18]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[17]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[16]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[15]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[14]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[13]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[12]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[11]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[10]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[9]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[8]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[7]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[6]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[5]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[4]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[3]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[2]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[1]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[0]}]
set_load -pin_load 24.6946 [get_ports dmem_csb_read_o]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[7]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[6]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[5]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[4]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[3]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[2]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[1]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[0]}]
set_timing_derate -late -net_delay 1 
set_timing_derate -early -net_delay 0.8 
set_timing_derate -late -cell_delay 1 
set_timing_derate -early -cell_delay 0.8 
group_path -name Feedthroughs  -from [list [get_ports clk_i] [get_ports reset_i] [get_ports {imem_inst_i[31]}] [get_ports {imem_inst_i[30]}] [get_ports {imem_inst_i[29]}] [get_ports {imem_inst_i[28]}] [get_ports {imem_inst_i[27]}] [get_ports {imem_inst_i[26]}] [get_ports {imem_inst_i[25]}] [get_ports {imem_inst_i[24]}] [get_ports {imem_inst_i[23]}] [get_ports {imem_inst_i[22]}] [get_ports {imem_inst_i[21]}] [get_ports {imem_inst_i[20]}] [get_ports {imem_inst_i[19]}] [get_ports {imem_inst_i[18]}] [get_ports {imem_inst_i[17]}] [get_ports {imem_inst_i[16]}] [get_ports {imem_inst_i[15]}] [get_ports {imem_inst_i[14]}] [get_ports {imem_inst_i[13]}] [get_ports {imem_inst_i[12]}] [get_ports {imem_inst_i[11]}] [get_ports {imem_inst_i[10]}] [get_ports {imem_inst_i[9]}] [get_ports {imem_inst_i[8]}] [get_ports {imem_inst_i[7]}] [get_ports {imem_inst_i[6]}] [get_ports {imem_inst_i[5]}] [get_ports {imem_inst_i[4]}] [get_ports {imem_inst_i[3]}] [get_ports {imem_inst_i[2]}] [get_ports {imem_inst_i[1]}] [get_ports {imem_inst_i[0]}] [get_ports {dmem_dout_i[31]}] [get_ports {dmem_dout_i[30]}] [get_ports {dmem_dout_i[29]}] [get_ports {dmem_dout_i[28]}] [get_ports {dmem_dout_i[27]}] [get_ports {dmem_dout_i[26]}] [get_ports {dmem_dout_i[25]}] [get_ports {dmem_dout_i[24]}] [get_ports {dmem_dout_i[23]}] [get_ports {dmem_dout_i[22]}] [get_ports {dmem_dout_i[21]}] [get_ports {dmem_dout_i[20]}] [get_ports {dmem_dout_i[19]}] [get_ports {dmem_dout_i[18]}] [get_ports {dmem_dout_i[17]}] [get_ports {dmem_dout_i[16]}] [get_ports {dmem_dout_i[15]}] [get_ports {dmem_dout_i[14]}] [get_ports {dmem_dout_i[13]}] [get_ports {dmem_dout_i[12]}] [get_ports {dmem_dout_i[11]}] [get_ports {dmem_dout_i[10]}] [get_ports {dmem_dout_i[9]}] [get_ports {dmem_dout_i[8]}] [get_ports {dmem_dout_i[7]}] [get_ports {dmem_dout_i[6]}] [get_ports {dmem_dout_i[5]}] [get_ports {dmem_dout_i[4]}] [get_ports {dmem_dout_i[3]}] [get_ports {dmem_dout_i[2]}] [get_ports {dmem_dout_i[1]}] [get_ports {dmem_dout_i[0]}]]  -to [list [get_ports {imem_addr_o[7]}] [get_ports {imem_addr_o[6]}] [get_ports {imem_addr_o[5]}] [get_ports {imem_addr_o[4]}] [get_ports {imem_addr_o[3]}] [get_ports {imem_addr_o[2]}] [get_ports {imem_addr_o[1]}] [get_ports {imem_addr_o[0]}] [get_ports dmem_csb_write_o] [get_ports {dmem_wmask_o[3]}] [get_ports {dmem_wmask_o[2]}] [get_ports {dmem_wmask_o[1]}] [get_ports {dmem_wmask_o[0]}] [get_ports {dmem_waddr_o[7]}] [get_ports {dmem_waddr_o[6]}] [get_ports {dmem_waddr_o[5]}] [get_ports {dmem_waddr_o[4]}] [get_ports {dmem_waddr_o[3]}] [get_ports {dmem_waddr_o[2]}] [get_ports {dmem_waddr_o[1]}] [get_ports {dmem_waddr_o[0]}] [get_ports {dmem_din_o[31]}] [get_ports {dmem_din_o[30]}] [get_ports {dmem_din_o[29]}] [get_ports {dmem_din_o[28]}] [get_ports {dmem_din_o[27]}] [get_ports {dmem_din_o[26]}] [get_ports {dmem_din_o[25]}] [get_ports {dmem_din_o[24]}] [get_ports {dmem_din_o[23]}] [get_ports {dmem_din_o[22]}] [get_ports {dmem_din_o[21]}] [get_ports {dmem_din_o[20]}] [get_ports {dmem_din_o[19]}] [get_ports {dmem_din_o[18]}] [get_ports {dmem_din_o[17]}] [get_ports {dmem_din_o[16]}] [get_ports {dmem_din_o[15]}] [get_ports {dmem_din_o[14]}] [get_ports {dmem_din_o[13]}] [get_ports {dmem_din_o[12]}] [get_ports {dmem_din_o[11]}] [get_ports {dmem_din_o[10]}] [get_ports {dmem_din_o[9]}] [get_ports {dmem_din_o[8]}] [get_ports {dmem_din_o[7]}] [get_ports {dmem_din_o[6]}] [get_ports {dmem_din_o[5]}] [get_ports {dmem_din_o[4]}] [get_ports {dmem_din_o[3]}] [get_ports {dmem_din_o[2]}] [get_ports {dmem_din_o[1]}] [get_ports {dmem_din_o[0]}] [get_ports dmem_csb_read_o] [get_ports {dmem_raddr_o[7]}] [get_ports {dmem_raddr_o[6]}] [get_ports {dmem_raddr_o[5]}] [get_ports {dmem_raddr_o[4]}] [get_ports {dmem_raddr_o[3]}] [get_ports {dmem_raddr_o[2]}] [get_ports {dmem_raddr_o[1]}] [get_ports {dmem_raddr_o[0]}]]
group_path -name Inputs  -from [list [get_ports clk_i] [get_ports reset_i] [get_ports {imem_inst_i[31]}] [get_ports {imem_inst_i[30]}] [get_ports {imem_inst_i[29]}] [get_ports {imem_inst_i[28]}] [get_ports {imem_inst_i[27]}] [get_ports {imem_inst_i[26]}] [get_ports {imem_inst_i[25]}] [get_ports {imem_inst_i[24]}] [get_ports {imem_inst_i[23]}] [get_ports {imem_inst_i[22]}] [get_ports {imem_inst_i[21]}] [get_ports {imem_inst_i[20]}] [get_ports {imem_inst_i[19]}] [get_ports {imem_inst_i[18]}] [get_ports {imem_inst_i[17]}] [get_ports {imem_inst_i[16]}] [get_ports {imem_inst_i[15]}] [get_ports {imem_inst_i[14]}] [get_ports {imem_inst_i[13]}] [get_ports {imem_inst_i[12]}] [get_ports {imem_inst_i[11]}] [get_ports {imem_inst_i[10]}] [get_ports {imem_inst_i[9]}] [get_ports {imem_inst_i[8]}] [get_ports {imem_inst_i[7]}] [get_ports {imem_inst_i[6]}] [get_ports {imem_inst_i[5]}] [get_ports {imem_inst_i[4]}] [get_ports {imem_inst_i[3]}] [get_ports {imem_inst_i[2]}] [get_ports {imem_inst_i[1]}] [get_ports {imem_inst_i[0]}] [get_ports {dmem_dout_i[31]}] [get_ports {dmem_dout_i[30]}] [get_ports {dmem_dout_i[29]}] [get_ports {dmem_dout_i[28]}] [get_ports {dmem_dout_i[27]}] [get_ports {dmem_dout_i[26]}] [get_ports {dmem_dout_i[25]}] [get_ports {dmem_dout_i[24]}] [get_ports {dmem_dout_i[23]}] [get_ports {dmem_dout_i[22]}] [get_ports {dmem_dout_i[21]}] [get_ports {dmem_dout_i[20]}] [get_ports {dmem_dout_i[19]}] [get_ports {dmem_dout_i[18]}] [get_ports {dmem_dout_i[17]}] [get_ports {dmem_dout_i[16]}] [get_ports {dmem_dout_i[15]}] [get_ports {dmem_dout_i[14]}] [get_ports {dmem_dout_i[13]}] [get_ports {dmem_dout_i[12]}] [get_ports {dmem_dout_i[11]}] [get_ports {dmem_dout_i[10]}] [get_ports {dmem_dout_i[9]}] [get_ports {dmem_dout_i[8]}] [get_ports {dmem_dout_i[7]}] [get_ports {dmem_dout_i[6]}] [get_ports {dmem_dout_i[5]}] [get_ports {dmem_dout_i[4]}] [get_ports {dmem_dout_i[3]}] [get_ports {dmem_dout_i[2]}] [get_ports {dmem_dout_i[1]}] [get_ports {dmem_dout_i[0]}]]
group_path -name Outputs  -to [list [get_ports {imem_addr_o[7]}] [get_ports {imem_addr_o[6]}] [get_ports {imem_addr_o[5]}] [get_ports {imem_addr_o[4]}] [get_ports {imem_addr_o[3]}] [get_ports {imem_addr_o[2]}] [get_ports {imem_addr_o[1]}] [get_ports {imem_addr_o[0]}] [get_ports dmem_csb_write_o] [get_ports {dmem_wmask_o[3]}] [get_ports {dmem_wmask_o[2]}] [get_ports {dmem_wmask_o[1]}] [get_ports {dmem_wmask_o[0]}] [get_ports {dmem_waddr_o[7]}] [get_ports {dmem_waddr_o[6]}] [get_ports {dmem_waddr_o[5]}] [get_ports {dmem_waddr_o[4]}] [get_ports {dmem_waddr_o[3]}] [get_ports {dmem_waddr_o[2]}] [get_ports {dmem_waddr_o[1]}] [get_ports {dmem_waddr_o[0]}] [get_ports {dmem_din_o[31]}] [get_ports {dmem_din_o[30]}] [get_ports {dmem_din_o[29]}] [get_ports {dmem_din_o[28]}] [get_ports {dmem_din_o[27]}] [get_ports {dmem_din_o[26]}] [get_ports {dmem_din_o[25]}] [get_ports {dmem_din_o[24]}] [get_ports {dmem_din_o[23]}] [get_ports {dmem_din_o[22]}] [get_ports {dmem_din_o[21]}] [get_ports {dmem_din_o[20]}] [get_ports {dmem_din_o[19]}] [get_ports {dmem_din_o[18]}] [get_ports {dmem_din_o[17]}] [get_ports {dmem_din_o[16]}] [get_ports {dmem_din_o[15]}] [get_ports {dmem_din_o[14]}] [get_ports {dmem_din_o[13]}] [get_ports {dmem_din_o[12]}] [get_ports {dmem_din_o[11]}] [get_ports {dmem_din_o[10]}] [get_ports {dmem_din_o[9]}] [get_ports {dmem_din_o[8]}] [get_ports {dmem_din_o[7]}] [get_ports {dmem_din_o[6]}] [get_ports {dmem_din_o[5]}] [get_ports {dmem_din_o[4]}] [get_ports {dmem_din_o[3]}] [get_ports {dmem_din_o[2]}] [get_ports {dmem_din_o[1]}] [get_ports {dmem_din_o[0]}] [get_ports dmem_csb_read_o] [get_ports {dmem_raddr_o[7]}] [get_ports {dmem_raddr_o[6]}] [get_ports {dmem_raddr_o[5]}] [get_ports {dmem_raddr_o[4]}] [get_ports {dmem_raddr_o[3]}] [get_ports {dmem_raddr_o[2]}] [get_ports {dmem_raddr_o[1]}] [get_ports {dmem_raddr_o[0]}]]
group_path -name Regs_to_Regs  -from [list [get_cells lsu0/mem_h_reg] [get_cells lsu0/mem_signed_reg] [get_cells lsu0/mem_b_reg] [get_cells lsu0/mem_ls_reg] [get_cells lsu0/wmask_reg_0_] [get_cells lsu0/wmask_reg_1_] [get_cells lsu0/wmask_reg_2_] [get_cells lsu0/wmask_reg_3_] [get_cells lsu0/mem_aligned_reg] [get_cells lsu0/mem_load_success_reg] [get_cells reservation_station/genblk3_3__lsu_entry/prs1_ready_reg] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_0_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_1_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_2_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_3_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_4_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_5_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_6_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_7_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_8_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_9_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_10_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_11_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_12_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_13_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_14_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_20_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_21_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_22_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_23_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_24_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_25_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_26_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_27_] [get_cells reservation_station/genblk3_3__lsu_entry/entry_free_o_reg] [get_cells reservation_station/genblk3_3__lsu_entry/prs2_ready_reg] [get_cells reservation_station/genblk3_2__lsu_entry/prs1_ready_reg] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_0_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_1_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_2_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_3_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_4_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_5_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_6_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_7_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_8_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_9_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_10_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_11_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_12_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_13_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_14_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_20_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_21_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_22_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_23_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_24_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_25_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_26_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_27_] [get_cells reservation_station/genblk3_2__lsu_entry/entry_free_o_reg] [get_cells reservation_station/genblk3_2__lsu_entry/prs2_ready_reg] [get_cells reservation_station/genblk3_1__lsu_entry/prs1_ready_reg] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_0_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_1_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_2_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_3_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_4_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_5_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_6_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_7_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_8_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_9_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_10_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_11_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_12_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_13_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_14_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_20_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_21_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_22_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_23_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_24_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_25_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_26_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_27_] [get_cells reservation_station/genblk3_1__lsu_entry/entry_free_o_reg] [get_cells reservation_station/genblk3_1__lsu_entry/prs2_ready_reg] [get_cells reservation_station/genblk3_0__lsu_entry/prs1_ready_reg] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_0_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_1_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_2_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_3_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_4_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_5_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_6_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_7_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_8_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_9_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_10_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_11_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_12_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_13_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_14_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_20_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_21_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_22_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_23_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_24_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_25_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_26_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_27_] [get_cells reservation_station/genblk3_0__lsu_entry/entry_free_o_reg] [get_cells reservation_station/genblk3_0__lsu_entry/prs2_ready_reg] [get_cells reservation_station/genblk2_3__mul_entry/prs1_ready_reg] [get_cells reservation_station/genblk2_3__mul_entry/entry_free_o_reg] [get_cells reservation_station/genblk2_3__mul_entry/prs2_ready_reg] [get_cells reservation_station/genblk2_2__mul_entry/prs1_ready_reg] [get_cells reservation_station/genblk2_2__mul_entry/entry_free_o_reg] [get_cells reservation_station/genblk2_2__mul_entry/prs2_ready_reg] [get_cells reservation_station/genblk2_1__mul_entry/prs1_ready_reg] [get_cells reservation_station/genblk2_1__mul_entry/entry_free_o_reg] [get_cells reservation_station/genblk2_1__mul_entry/prs2_ready_reg] [get_cells reservation_station/genblk2_0__mul_entry/prs1_ready_reg] [get_cells reservation_station/genblk2_0__mul_entry/entry_free_o_reg] [get_cells reservation_station/genblk2_0__mul_entry/prs2_ready_reg] [get_cells reservation_station/genblk1_3__alu_entry/prs1_ready_reg] [get_cells reservation_station/genblk1_3__alu_entry/entry_free_o_reg] [get_cells reservation_station/genblk1_3__alu_entry/prs2_ready_reg] [get_cells reservation_station/genblk1_2__alu_entry/prs1_ready_reg] [get_cells reservation_station/genblk1_2__alu_entry/entry_free_o_reg] [get_cells reservation_station/genblk1_2__alu_entry/prs2_ready_reg] [get_cells reservation_station/genblk1_1__alu_entry/prs1_ready_reg] [get_cells reservation_station/genblk1_1__alu_entry/entry_free_o_reg] [get_cells reservation_station/genblk1_1__alu_entry/prs2_ready_reg] [get_cells reservation_station/genblk1_0__alu_entry/prs1_ready_reg] [get_cells reservation_station/genblk1_0__alu_entry/entry_free_o_reg] [get_cells reservation_station/genblk1_0__alu_entry/prs2_ready_reg] [get_cells rename/prs1_addr_o_reg_0_] [get_cells rename/prs1_addr_o_reg_1_] [get_cells rename/prs1_addr_o_reg_2_] [get_cells rename/prs1_addr_o_reg_3_] [get_cells rename/prs1_addr_o_reg_4_] [get_cells rename/busytable_reg_31_] [get_cells rename/busytable_reg_30_] [get_cells rename/busytable_reg_29_] [get_cells rename/busytable_reg_28_] [get_cells rename/busytable_reg_27_] [get_cells rename/busytable_reg_26_] [get_cells rename/busytable_reg_25_] [get_cells rename/busytable_reg_24_] [get_cells rename/busytable_reg_23_] [get_cells rename/busytable_reg_22_] [get_cells rename/busytable_reg_21_] [get_cells rename/busytable_reg_20_] [get_cells rename/busytable_reg_19_] [get_cells rename/busytable_reg_18_] [get_cells rename/busytable_reg_17_] [get_cells rename/busytable_reg_16_] [get_cells rename/busytable_reg_15_] [get_cells rename/busytable_reg_14_] [get_cells rename/busytable_reg_13_] [get_cells rename/busytable_reg_12_] [get_cells rename/busytable_reg_11_] [get_cells rename/busytable_reg_10_] [get_cells rename/busytable_reg_9_] [get_cells rename/busytable_reg_8_] [get_cells rename/busytable_reg_7_] [get_cells rename/busytable_reg_6_] [get_cells rename/busytable_reg_5_] [get_cells rename/busytable_reg_4_] [get_cells rename/busytable_reg_3_] [get_cells rename/busytable_reg_2_] [get_cells rename/busytable_reg_1_] [get_cells rename/busytable_reg_0_] [get_cells rename/rat_reg_31__0_] [get_cells rename/rat_reg_31__1_] [get_cells rename/rat_reg_31__2_] [get_cells rename/rat_reg_31__3_] [get_cells rename/rat_reg_31__4_] [get_cells rename/rat_reg_30__0_] [get_cells rename/rat_reg_30__1_] [get_cells rename/rat_reg_30__2_] [get_cells rename/rat_reg_30__3_] [get_cells rename/rat_reg_30__4_] [get_cells rename/rat_reg_29__0_] [get_cells rename/rat_reg_29__1_] [get_cells rename/rat_reg_29__2_] [get_cells rename/rat_reg_29__3_] [get_cells rename/rat_reg_29__4_] [get_cells rename/rat_reg_28__0_] [get_cells rename/rat_reg_28__1_] [get_cells rename/rat_reg_28__2_] [get_cells rename/rat_reg_28__3_] [get_cells rename/rat_reg_28__4_] [get_cells rename/rat_reg_27__0_] [get_cells rename/rat_reg_27__1_] [get_cells rename/rat_reg_27__2_] [get_cells rename/rat_reg_27__3_] [get_cells rename/rat_reg_27__4_] [get_cells rename/rat_reg_26__0_] [get_cells rename/rat_reg_26__1_] [get_cells rename/rat_reg_26__2_] [get_cells rename/rat_reg_26__3_] [get_cells rename/rat_reg_26__4_] [get_cells rename/rat_reg_25__0_] [get_cells rename/rat_reg_25__1_] [get_cells rename/rat_reg_25__2_] [get_cells rename/rat_reg_25__3_] [get_cells rename/rat_reg_25__4_] [get_cells rename/rat_reg_24__0_] [get_cells rename/rat_reg_24__1_] [get_cells rename/rat_reg_24__2_] [get_cells rename/rat_reg_24__3_] [get_cells rename/rat_reg_24__4_] [get_cells rename/rat_reg_23__0_] [get_cells rename/rat_reg_23__1_] [get_cells rename/rat_reg_23__2_] [get_cells rename/rat_reg_23__3_] [get_cells rename/rat_reg_23__4_] [get_cells rename/rat_reg_22__0_] [get_cells rename/rat_reg_22__1_] [get_cells rename/rat_reg_22__2_] [get_cells rename/rat_reg_22__3_] [get_cells rename/rat_reg_22__4_] [get_cells rename/rat_reg_21__0_] [get_cells rename/rat_reg_21__1_] [get_cells rename/rat_reg_21__2_] [get_cells rename/rat_reg_21__3_] [get_cells rename/rat_reg_21__4_] [get_cells rename/rat_reg_20__0_] [get_cells rename/rat_reg_20__1_] [get_cells rename/rat_reg_20__2_] [get_cells rename/rat_reg_20__3_] [get_cells rename/rat_reg_20__4_] [get_cells rename/rat_reg_19__0_] [get_cells rename/rat_reg_19__1_] [get_cells rename/rat_reg_19__2_] [get_cells rename/rat_reg_19__3_] [get_cells rename/rat_reg_19__4_] [get_cells rename/rat_reg_18__0_] [get_cells rename/rat_reg_18__1_] [get_cells rename/rat_reg_18__2_] [get_cells rename/rat_reg_18__3_] [get_cells rename/rat_reg_18__4_] [get_cells rename/rat_reg_17__0_] [get_cells rename/rat_reg_17__1_] [get_cells rename/rat_reg_17__2_] [get_cells rename/rat_reg_17__3_] [get_cells rename/rat_reg_17__4_] [get_cells rename/rat_reg_16__0_] [get_cells rename/rat_reg_16__1_] [get_cells rename/rat_reg_16__2_] [get_cells rename/rat_reg_16__3_] [get_cells rename/rat_reg_16__4_] [get_cells rename/rat_reg_15__0_] [get_cells rename/rat_reg_15__1_] [get_cells rename/rat_reg_15__2_] [get_cells rename/rat_reg_15__3_] [get_cells rename/rat_reg_15__4_] [get_cells rename/rat_reg_14__0_] [get_cells rename/rat_reg_14__1_] [get_cells rename/rat_reg_14__2_] [get_cells rename/rat_reg_14__3_] [get_cells rename/rat_reg_14__4_] [get_cells rename/rat_reg_13__0_] [get_cells rename/rat_reg_13__1_] [get_cells rename/rat_reg_13__2_] [get_cells rename/rat_reg_13__3_] [get_cells rename/rat_reg_13__4_] [get_cells rename/rat_reg_12__0_] [get_cells rename/rat_reg_12__1_] [get_cells rename/rat_reg_12__2_] [get_cells rename/rat_reg_12__3_] [get_cells rename/rat_reg_12__4_] [get_cells rename/rat_reg_11__0_] [get_cells rename/rat_reg_11__1_] [get_cells rename/rat_reg_11__2_] [get_cells rename/rat_reg_11__3_] [get_cells rename/rat_reg_11__4_] [get_cells rename/rat_reg_10__0_] [get_cells rename/rat_reg_10__1_] [get_cells rename/rat_reg_10__2_] [get_cells rename/rat_reg_10__3_] [get_cells rename/rat_reg_10__4_] [get_cells rename/rat_reg_9__0_] [get_cells rename/rat_reg_9__1_] [get_cells rename/rat_reg_9__2_] [get_cells rename/rat_reg_9__3_] [get_cells rename/rat_reg_9__4_] [get_cells rename/rat_reg_8__0_] [get_cells rename/rat_reg_8__1_] [get_cells rename/rat_reg_8__2_] [get_cells rename/rat_reg_8__3_] [get_cells rename/rat_reg_8__4_] [get_cells rename/rat_reg_7__0_] [get_cells rename/rat_reg_7__1_] [get_cells rename/rat_reg_7__2_] [get_cells rename/rat_reg_7__3_] [get_cells rename/rat_reg_7__4_] [get_cells rename/rat_reg_6__0_] [get_cells rename/rat_reg_6__1_] [get_cells rename/rat_reg_6__2_] [get_cells rename/rat_reg_6__3_] [get_cells rename/rat_reg_6__4_] [get_cells rename/rat_reg_5__0_] [get_cells rename/rat_reg_5__1_] [get_cells rename/rat_reg_5__2_] [get_cells rename/rat_reg_5__3_] [get_cells rename/rat_reg_5__4_] [get_cells rename/rat_reg_4__0_] [get_cells rename/rat_reg_4__1_] [get_cells rename/rat_reg_4__2_] [get_cells rename/rat_reg_4__3_] [get_cells rename/rat_reg_4__4_] [get_cells rename/rat_reg_3__0_] [get_cells rename/rat_reg_3__1_] [get_cells rename/rat_reg_3__2_] [get_cells rename/rat_reg_3__3_] [get_cells rename/rat_reg_3__4_] [get_cells rename/rat_reg_2__0_] [get_cells rename/rat_reg_2__1_] [get_cells rename/rat_reg_2__2_] [get_cells rename/rat_reg_2__3_] [get_cells rename/rat_reg_2__4_] [get_cells rename/rat_reg_1__0_] [get_cells rename/rat_reg_1__1_] [get_cells rename/rat_reg_1__2_] [get_cells rename/rat_reg_1__3_] [get_cells rename/rat_reg_1__4_] [get_cells rename/rat_reg_0__0_] [get_cells rename/rat_reg_0__1_] [get_cells rename/rat_reg_0__2_] [get_cells rename/rat_reg_0__3_] [get_cells rename/rat_reg_0__4_] [get_cells rename/prs2_addr_o_reg_0_] [get_cells rename/prs2_addr_o_reg_1_] [get_cells rename/prs2_addr_o_reg_2_] [get_cells rename/prs2_addr_o_reg_3_] [get_cells rename/prs2_addr_o_reg_4_] [get_cells rename/freelist0/head_reg_0_] [get_cells rename/freelist0/head_reg_1_] [get_cells rename/freelist0/head_reg_2_] [get_cells rename/freelist0/head_reg_3_] [get_cells rename/freelist0/head_reg_4_] [get_cells fetch/pc_reg_2_] [get_cells fetch/pc_reg_3_] [get_cells fetch/pc_reg_4_] [get_cells fetch/pc_reg_5_] [get_cells fetch/pc_reg_6_] [get_cells fetch/pc_reg_7_] [get_cells fetch/pc_reg_8_] [get_cells fetch/pc_reg_9_] [get_cells fetch/inst_valid_reg_0_] [get_cells fetch/inst_o_reg_0_] [get_cells fetch/inst_o_reg_1_] [get_cells fetch/inst_o_reg_2_] [get_cells fetch/inst_o_reg_3_] [get_cells fetch/inst_o_reg_4_] [get_cells fetch/inst_o_reg_5_] [get_cells fetch/inst_o_reg_6_] [get_cells fetch/inst_o_reg_7_] [get_cells fetch/inst_o_reg_8_] [get_cells fetch/inst_o_reg_9_] [get_cells fetch/inst_o_reg_10_] [get_cells fetch/inst_o_reg_11_] [get_cells fetch/inst_o_reg_12_] [get_cells fetch/inst_o_reg_13_] [get_cells fetch/inst_o_reg_14_] [get_cells fetch/inst_o_reg_15_] [get_cells fetch/inst_o_reg_16_] [get_cells fetch/inst_o_reg_17_] [get_cells fetch/inst_o_reg_18_] [get_cells fetch/inst_o_reg_19_] [get_cells fetch/inst_o_reg_20_] [get_cells fetch/inst_o_reg_21_] [get_cells fetch/inst_o_reg_22_] [get_cells fetch/inst_o_reg_23_] [get_cells fetch/inst_o_reg_24_] [get_cells fetch/inst_o_reg_25_] [get_cells fetch/inst_o_reg_26_] [get_cells fetch/inst_o_reg_27_] [get_cells fetch/inst_o_reg_28_] [get_cells fetch/inst_o_reg_29_] [get_cells fetch/inst_o_reg_30_] [get_cells fetch/inst_o_reg_31_] [get_cells fetch/inst_valid_o_reg]]  -to [list [get_cells lsu0/mem_h_reg] [get_cells lsu0/mem_signed_reg] [get_cells lsu0/mem_b_reg] [get_cells lsu0/mem_ls_reg] [get_cells lsu0/wmask_reg_0_] [get_cells lsu0/wmask_reg_1_] [get_cells lsu0/wmask_reg_2_] [get_cells lsu0/wmask_reg_3_] [get_cells lsu0/mem_aligned_reg] [get_cells lsu0/mem_load_success_reg] [get_cells reservation_station/genblk3_3__lsu_entry/prs1_ready_reg] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_0_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_1_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_2_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_3_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_4_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_5_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_6_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_7_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_8_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_9_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_10_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_11_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_12_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_13_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_14_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_20_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_21_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_22_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_23_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_24_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_25_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_26_] [get_cells reservation_station/genblk3_3__lsu_entry/inst_o_reg_27_] [get_cells reservation_station/genblk3_3__lsu_entry/entry_free_o_reg] [get_cells reservation_station/genblk3_3__lsu_entry/prs2_ready_reg] [get_cells reservation_station/genblk3_2__lsu_entry/prs1_ready_reg] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_0_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_1_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_2_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_3_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_4_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_5_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_6_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_7_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_8_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_9_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_10_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_11_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_12_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_13_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_14_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_20_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_21_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_22_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_23_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_24_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_25_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_26_] [get_cells reservation_station/genblk3_2__lsu_entry/inst_o_reg_27_] [get_cells reservation_station/genblk3_2__lsu_entry/entry_free_o_reg] [get_cells reservation_station/genblk3_2__lsu_entry/prs2_ready_reg] [get_cells reservation_station/genblk3_1__lsu_entry/prs1_ready_reg] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_0_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_1_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_2_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_3_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_4_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_5_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_6_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_7_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_8_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_9_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_10_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_11_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_12_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_13_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_14_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_20_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_21_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_22_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_23_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_24_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_25_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_26_] [get_cells reservation_station/genblk3_1__lsu_entry/inst_o_reg_27_] [get_cells reservation_station/genblk3_1__lsu_entry/entry_free_o_reg] [get_cells reservation_station/genblk3_1__lsu_entry/prs2_ready_reg] [get_cells reservation_station/genblk3_0__lsu_entry/prs1_ready_reg] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_0_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_1_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_2_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_3_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_4_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_5_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_6_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_7_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_8_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_9_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_10_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_11_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_12_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_13_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_14_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_20_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_21_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_22_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_23_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_24_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_25_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_26_] [get_cells reservation_station/genblk3_0__lsu_entry/inst_o_reg_27_] [get_cells reservation_station/genblk3_0__lsu_entry/entry_free_o_reg] [get_cells reservation_station/genblk3_0__lsu_entry/prs2_ready_reg] [get_cells reservation_station/genblk2_3__mul_entry/prs1_ready_reg] [get_cells reservation_station/genblk2_3__mul_entry/entry_free_o_reg] [get_cells reservation_station/genblk2_3__mul_entry/prs2_ready_reg] [get_cells reservation_station/genblk2_2__mul_entry/prs1_ready_reg] [get_cells reservation_station/genblk2_2__mul_entry/entry_free_o_reg] [get_cells reservation_station/genblk2_2__mul_entry/prs2_ready_reg] [get_cells reservation_station/genblk2_1__mul_entry/prs1_ready_reg] [get_cells reservation_station/genblk2_1__mul_entry/entry_free_o_reg] [get_cells reservation_station/genblk2_1__mul_entry/prs2_ready_reg] [get_cells reservation_station/genblk2_0__mul_entry/prs1_ready_reg] [get_cells reservation_station/genblk2_0__mul_entry/entry_free_o_reg] [get_cells reservation_station/genblk2_0__mul_entry/prs2_ready_reg] [get_cells reservation_station/genblk1_3__alu_entry/prs1_ready_reg] [get_cells reservation_station/genblk1_3__alu_entry/entry_free_o_reg] [get_cells reservation_station/genblk1_3__alu_entry/prs2_ready_reg] [get_cells reservation_station/genblk1_2__alu_entry/prs1_ready_reg] [get_cells reservation_station/genblk1_2__alu_entry/entry_free_o_reg] [get_cells reservation_station/genblk1_2__alu_entry/prs2_ready_reg] [get_cells reservation_station/genblk1_1__alu_entry/prs1_ready_reg] [get_cells reservation_station/genblk1_1__alu_entry/entry_free_o_reg] [get_cells reservation_station/genblk1_1__alu_entry/prs2_ready_reg] [get_cells reservation_station/genblk1_0__alu_entry/prs1_ready_reg] [get_cells reservation_station/genblk1_0__alu_entry/entry_free_o_reg] [get_cells reservation_station/genblk1_0__alu_entry/prs2_ready_reg] [get_cells rename/prs1_addr_o_reg_0_] [get_cells rename/prs1_addr_o_reg_1_] [get_cells rename/prs1_addr_o_reg_2_] [get_cells rename/prs1_addr_o_reg_3_] [get_cells rename/prs1_addr_o_reg_4_] [get_cells rename/busytable_reg_31_] [get_cells rename/busytable_reg_30_] [get_cells rename/busytable_reg_29_] [get_cells rename/busytable_reg_28_] [get_cells rename/busytable_reg_27_] [get_cells rename/busytable_reg_26_] [get_cells rename/busytable_reg_25_] [get_cells rename/busytable_reg_24_] [get_cells rename/busytable_reg_23_] [get_cells rename/busytable_reg_22_] [get_cells rename/busytable_reg_21_] [get_cells rename/busytable_reg_20_] [get_cells rename/busytable_reg_19_] [get_cells rename/busytable_reg_18_] [get_cells rename/busytable_reg_17_] [get_cells rename/busytable_reg_16_] [get_cells rename/busytable_reg_15_] [get_cells rename/busytable_reg_14_] [get_cells rename/busytable_reg_13_] [get_cells rename/busytable_reg_12_] [get_cells rename/busytable_reg_11_] [get_cells rename/busytable_reg_10_] [get_cells rename/busytable_reg_9_] [get_cells rename/busytable_reg_8_] [get_cells rename/busytable_reg_7_] [get_cells rename/busytable_reg_6_] [get_cells rename/busytable_reg_5_] [get_cells rename/busytable_reg_4_] [get_cells rename/busytable_reg_3_] [get_cells rename/busytable_reg_2_] [get_cells rename/busytable_reg_1_] [get_cells rename/busytable_reg_0_] [get_cells rename/rat_reg_31__0_] [get_cells rename/rat_reg_31__1_] [get_cells rename/rat_reg_31__2_] [get_cells rename/rat_reg_31__3_] [get_cells rename/rat_reg_31__4_] [get_cells rename/rat_reg_30__0_] [get_cells rename/rat_reg_30__1_] [get_cells rename/rat_reg_30__2_] [get_cells rename/rat_reg_30__3_] [get_cells rename/rat_reg_30__4_] [get_cells rename/rat_reg_29__0_] [get_cells rename/rat_reg_29__1_] [get_cells rename/rat_reg_29__2_] [get_cells rename/rat_reg_29__3_] [get_cells rename/rat_reg_29__4_] [get_cells rename/rat_reg_28__0_] [get_cells rename/rat_reg_28__1_] [get_cells rename/rat_reg_28__2_] [get_cells rename/rat_reg_28__3_] [get_cells rename/rat_reg_28__4_] [get_cells rename/rat_reg_27__0_] [get_cells rename/rat_reg_27__1_] [get_cells rename/rat_reg_27__2_] [get_cells rename/rat_reg_27__3_] [get_cells rename/rat_reg_27__4_] [get_cells rename/rat_reg_26__0_] [get_cells rename/rat_reg_26__1_] [get_cells rename/rat_reg_26__2_] [get_cells rename/rat_reg_26__3_] [get_cells rename/rat_reg_26__4_] [get_cells rename/rat_reg_25__0_] [get_cells rename/rat_reg_25__1_] [get_cells rename/rat_reg_25__2_] [get_cells rename/rat_reg_25__3_] [get_cells rename/rat_reg_25__4_] [get_cells rename/rat_reg_24__0_] [get_cells rename/rat_reg_24__1_] [get_cells rename/rat_reg_24__2_] [get_cells rename/rat_reg_24__3_] [get_cells rename/rat_reg_24__4_] [get_cells rename/rat_reg_23__0_] [get_cells rename/rat_reg_23__1_] [get_cells rename/rat_reg_23__2_] [get_cells rename/rat_reg_23__3_] [get_cells rename/rat_reg_23__4_] [get_cells rename/rat_reg_22__0_] [get_cells rename/rat_reg_22__1_] [get_cells rename/rat_reg_22__2_] [get_cells rename/rat_reg_22__3_] [get_cells rename/rat_reg_22__4_] [get_cells rename/rat_reg_21__0_] [get_cells rename/rat_reg_21__1_] [get_cells rename/rat_reg_21__2_] [get_cells rename/rat_reg_21__3_] [get_cells rename/rat_reg_21__4_] [get_cells rename/rat_reg_20__0_] [get_cells rename/rat_reg_20__1_] [get_cells rename/rat_reg_20__2_] [get_cells rename/rat_reg_20__3_] [get_cells rename/rat_reg_20__4_] [get_cells rename/rat_reg_19__0_] [get_cells rename/rat_reg_19__1_] [get_cells rename/rat_reg_19__2_] [get_cells rename/rat_reg_19__3_] [get_cells rename/rat_reg_19__4_] [get_cells rename/rat_reg_18__0_] [get_cells rename/rat_reg_18__1_] [get_cells rename/rat_reg_18__2_] [get_cells rename/rat_reg_18__3_] [get_cells rename/rat_reg_18__4_] [get_cells rename/rat_reg_17__0_] [get_cells rename/rat_reg_17__1_] [get_cells rename/rat_reg_17__2_] [get_cells rename/rat_reg_17__3_] [get_cells rename/rat_reg_17__4_] [get_cells rename/rat_reg_16__0_] [get_cells rename/rat_reg_16__1_] [get_cells rename/rat_reg_16__2_] [get_cells rename/rat_reg_16__3_] [get_cells rename/rat_reg_16__4_] [get_cells rename/rat_reg_15__0_] [get_cells rename/rat_reg_15__1_] [get_cells rename/rat_reg_15__2_] [get_cells rename/rat_reg_15__3_] [get_cells rename/rat_reg_15__4_] [get_cells rename/rat_reg_14__0_] [get_cells rename/rat_reg_14__1_] [get_cells rename/rat_reg_14__2_] [get_cells rename/rat_reg_14__3_] [get_cells rename/rat_reg_14__4_] [get_cells rename/rat_reg_13__0_] [get_cells rename/rat_reg_13__1_] [get_cells rename/rat_reg_13__2_] [get_cells rename/rat_reg_13__3_] [get_cells rename/rat_reg_13__4_] [get_cells rename/rat_reg_12__0_] [get_cells rename/rat_reg_12__1_] [get_cells rename/rat_reg_12__2_] [get_cells rename/rat_reg_12__3_] [get_cells rename/rat_reg_12__4_] [get_cells rename/rat_reg_11__0_] [get_cells rename/rat_reg_11__1_] [get_cells rename/rat_reg_11__2_] [get_cells rename/rat_reg_11__3_] [get_cells rename/rat_reg_11__4_] [get_cells rename/rat_reg_10__0_] [get_cells rename/rat_reg_10__1_] [get_cells rename/rat_reg_10__2_] [get_cells rename/rat_reg_10__3_] [get_cells rename/rat_reg_10__4_] [get_cells rename/rat_reg_9__0_] [get_cells rename/rat_reg_9__1_] [get_cells rename/rat_reg_9__2_] [get_cells rename/rat_reg_9__3_] [get_cells rename/rat_reg_9__4_] [get_cells rename/rat_reg_8__0_] [get_cells rename/rat_reg_8__1_] [get_cells rename/rat_reg_8__2_] [get_cells rename/rat_reg_8__3_] [get_cells rename/rat_reg_8__4_] [get_cells rename/rat_reg_7__0_] [get_cells rename/rat_reg_7__1_] [get_cells rename/rat_reg_7__2_] [get_cells rename/rat_reg_7__3_] [get_cells rename/rat_reg_7__4_] [get_cells rename/rat_reg_6__0_] [get_cells rename/rat_reg_6__1_] [get_cells rename/rat_reg_6__2_] [get_cells rename/rat_reg_6__3_] [get_cells rename/rat_reg_6__4_] [get_cells rename/rat_reg_5__0_] [get_cells rename/rat_reg_5__1_] [get_cells rename/rat_reg_5__2_] [get_cells rename/rat_reg_5__3_] [get_cells rename/rat_reg_5__4_] [get_cells rename/rat_reg_4__0_] [get_cells rename/rat_reg_4__1_] [get_cells rename/rat_reg_4__2_] [get_cells rename/rat_reg_4__3_] [get_cells rename/rat_reg_4__4_] [get_cells rename/rat_reg_3__0_] [get_cells rename/rat_reg_3__1_] [get_cells rename/rat_reg_3__2_] [get_cells rename/rat_reg_3__3_] [get_cells rename/rat_reg_3__4_] [get_cells rename/rat_reg_2__0_] [get_cells rename/rat_reg_2__1_] [get_cells rename/rat_reg_2__2_] [get_cells rename/rat_reg_2__3_] [get_cells rename/rat_reg_2__4_] [get_cells rename/rat_reg_1__0_] [get_cells rename/rat_reg_1__1_] [get_cells rename/rat_reg_1__2_] [get_cells rename/rat_reg_1__3_] [get_cells rename/rat_reg_1__4_] [get_cells rename/rat_reg_0__0_] [get_cells rename/rat_reg_0__1_] [get_cells rename/rat_reg_0__2_] [get_cells rename/rat_reg_0__3_] [get_cells rename/rat_reg_0__4_] [get_cells rename/prs2_addr_o_reg_0_] [get_cells rename/prs2_addr_o_reg_1_] [get_cells rename/prs2_addr_o_reg_2_] [get_cells rename/prs2_addr_o_reg_3_] [get_cells rename/prs2_addr_o_reg_4_] [get_cells rename/freelist0/head_reg_0_] [get_cells rename/freelist0/head_reg_1_] [get_cells rename/freelist0/head_reg_2_] [get_cells rename/freelist0/head_reg_3_] [get_cells rename/freelist0/head_reg_4_] [get_cells fetch/pc_reg_2_] [get_cells fetch/pc_reg_3_] [get_cells fetch/pc_reg_4_] [get_cells fetch/pc_reg_5_] [get_cells fetch/pc_reg_6_] [get_cells fetch/pc_reg_7_] [get_cells fetch/pc_reg_8_] [get_cells fetch/pc_reg_9_] [get_cells fetch/inst_valid_reg_0_] [get_cells fetch/inst_o_reg_0_] [get_cells fetch/inst_o_reg_1_] [get_cells fetch/inst_o_reg_2_] [get_cells fetch/inst_o_reg_3_] [get_cells fetch/inst_o_reg_4_] [get_cells fetch/inst_o_reg_5_] [get_cells fetch/inst_o_reg_6_] [get_cells fetch/inst_o_reg_7_] [get_cells fetch/inst_o_reg_8_] [get_cells fetch/inst_o_reg_9_] [get_cells fetch/inst_o_reg_10_] [get_cells fetch/inst_o_reg_11_] [get_cells fetch/inst_o_reg_12_] [get_cells fetch/inst_o_reg_13_] [get_cells fetch/inst_o_reg_14_] [get_cells fetch/inst_o_reg_15_] [get_cells fetch/inst_o_reg_16_] [get_cells fetch/inst_o_reg_17_] [get_cells fetch/inst_o_reg_18_] [get_cells fetch/inst_o_reg_19_] [get_cells fetch/inst_o_reg_20_] [get_cells fetch/inst_o_reg_21_] [get_cells fetch/inst_o_reg_22_] [get_cells fetch/inst_o_reg_23_] [get_cells fetch/inst_o_reg_24_] [get_cells fetch/inst_o_reg_25_] [get_cells fetch/inst_o_reg_26_] [get_cells fetch/inst_o_reg_27_] [get_cells fetch/inst_o_reg_28_] [get_cells fetch/inst_o_reg_29_] [get_cells fetch/inst_o_reg_30_] [get_cells fetch/inst_o_reg_31_] [get_cells fetch/inst_valid_o_reg]]
set_drive 0.00865463  [get_ports clk_i]
set_drive 0.00865463  [get_ports reset_i]
set_drive 0.00865463  [get_ports {imem_inst_i[31]}]
set_drive 0.00865463  [get_ports {imem_inst_i[30]}]
set_drive 0.00865463  [get_ports {imem_inst_i[29]}]
set_drive 0.00865463  [get_ports {imem_inst_i[28]}]
set_drive 0.00865463  [get_ports {imem_inst_i[27]}]
set_drive 0.00865463  [get_ports {imem_inst_i[26]}]
set_drive 0.00865463  [get_ports {imem_inst_i[25]}]
set_drive 0.00865463  [get_ports {imem_inst_i[24]}]
set_drive 0.00865463  [get_ports {imem_inst_i[23]}]
set_drive 0.00865463  [get_ports {imem_inst_i[22]}]
set_drive 0.00865463  [get_ports {imem_inst_i[21]}]
set_drive 0.00865463  [get_ports {imem_inst_i[20]}]
set_drive 0.00865463  [get_ports {imem_inst_i[19]}]
set_drive 0.00865463  [get_ports {imem_inst_i[18]}]
set_drive 0.00865463  [get_ports {imem_inst_i[17]}]
set_drive 0.00865463  [get_ports {imem_inst_i[16]}]
set_drive 0.00865463  [get_ports {imem_inst_i[15]}]
set_drive 0.00865463  [get_ports {imem_inst_i[14]}]
set_drive 0.00865463  [get_ports {imem_inst_i[13]}]
set_drive 0.00865463  [get_ports {imem_inst_i[12]}]
set_drive 0.00865463  [get_ports {imem_inst_i[11]}]
set_drive 0.00865463  [get_ports {imem_inst_i[10]}]
set_drive 0.00865463  [get_ports {imem_inst_i[9]}]
set_drive 0.00865463  [get_ports {imem_inst_i[8]}]
set_drive 0.00865463  [get_ports {imem_inst_i[7]}]
set_drive 0.00865463  [get_ports {imem_inst_i[6]}]
set_drive 0.00865463  [get_ports {imem_inst_i[5]}]
set_drive 0.00865463  [get_ports {imem_inst_i[4]}]
set_drive 0.00865463  [get_ports {imem_inst_i[3]}]
set_drive 0.00865463  [get_ports {imem_inst_i[2]}]
set_drive 0.00865463  [get_ports {imem_inst_i[1]}]
set_drive 0.00865463  [get_ports {imem_inst_i[0]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[31]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[30]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[29]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[28]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[27]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[26]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[25]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[24]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[23]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[22]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[21]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[20]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[19]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[18]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[17]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[16]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[15]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[14]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[13]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[12]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[11]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[10]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[9]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[8]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[7]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[6]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[5]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[4]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[3]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[2]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[1]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[0]}]
