###################################################################

# Created by write_sdc on Tue May 16 23:07:53 2023

###################################################################
set sdc_version 1.7

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_operating_conditions -max slow -max_library stdcells-wc.db:NangateOpenCellLibrary -min fast -min_library stdcells-bc.db:NangateOpenCellLibrary
set_max_fanout 32 [current_design]
set_max_transition 1 [current_design]
set_load -pin_load 24.6946 [get_ports {Status[0]}]
set_load -pin_load 24.6946 [get_ports Output2]
set_load -pin_load 24.6946 [get_ports Output1]
set_load -pin_load 24.6946 [get_ports {Status[2]}]
set_load -pin_load 24.6946 [get_ports {Status[1]}]
set_propagated_clock [get_ports Clock]
set_timing_derate -late -net_delay 1 
set_timing_derate -early -net_delay 0.8 
set_timing_derate -late -cell_delay 1 
set_timing_derate -early -cell_delay 0.8 
create_clock [get_ports Clock]  -name clk  -period 5  -waveform {0 2}
set_clock_uncertainty -setup 0.05  [get_clocks clk]
set_clock_uncertainty -hold 0.01  [get_clocks clk]
group_path -name Feedthroughs  -from [list [get_ports Reset] [get_ports A] [get_ports B]]  -to [list [get_ports {Status[2]}] [get_ports {Status[1]}] [get_ports {Status[0]}] [get_ports Output1] [get_ports Output2]]
group_path -name Inputs  -from [list [get_ports Reset] [get_ports A] [get_ports B]]
group_path -name Outputs  -to [list [get_ports {Status[2]}] [get_ports {Status[1]}] [get_ports {Status[0]}] [get_ports Output1] [get_ports Output2]]
group_path -name Regs_to_Regs  -from [list [get_cells Output1_reg] [get_cells Status_reg_0_] [get_cells Status_reg_1_] [get_cells Output2_reg] [get_cells ps_reg_0_] [get_cells ps_reg_2_]]  -to [list [get_cells Output1_reg] [get_cells Status_reg_0_] [get_cells Status_reg_1_] [get_cells Output2_reg] [get_cells ps_reg_0_] [get_cells ps_reg_2_]]
set_input_delay -clock clk  0.1  [get_ports Reset]
set_input_delay -clock clk  0.1  [get_ports A]
set_input_delay -clock clk  0.1  [get_ports B]
set_output_delay -clock clk  0.1  [get_ports {Status[2]}]
set_output_delay -clock clk  0.1  [get_ports {Status[1]}]
set_output_delay -clock clk  0.1  [get_ports {Status[0]}]
set_output_delay -clock clk  0.1  [get_ports Output1]
set_output_delay -clock clk  0.1  [get_ports Output2]
set_drive 0.00865463  [get_ports B]
set_drive 0.00865463  [get_ports A]
set_drive 0.00865463  [get_ports Clock]
set_drive 0.00865463  [get_ports Reset]
set_load 0.023321  [get_nets LOGIC1_X1!U0_net]
set_load 0.602712  [get_nets n48]
set_load 0.374204  [get_nets n47]
set_load 0.240763  [get_nets n46]
set_load 0.367262  [get_nets N61]
set_load 0.975273  [get_nets n50]
set_load 0.365586  [get_nets n45]
set_load 0.138923  [get_nets N60]
set_load 0.467593  [get_nets n44]
set_load 0.315238  [get_nets n43]
set_load 0.328083  [get_nets n42]
set_load 0.19027  [get_nets n40]
set_load 0.178335  [get_nets n41]
set_load 0.270493  [get_nets N62]
set_load 0.135621  [get_nets N63]
set_load 0.0773327  [get_nets n39]
set_load 0.48883  [get_nets n38]
set_load 0.768648  [get_nets n49]
set_load 0.261488  [get_nets n37]
set_load 0.325082  [get_nets n36]
set_load 0.368158  [get_nets n3]
set_load 0.317196  [get_nets {ps[2]}]
set_load 0.133612  [get_nets n35]
set_load 0.193683  [get_nets {ps[0]}]
set_load 0.336172  [get_nets n34]
set_load 0.0661588  [get_nets n33]
set_load 0.341712  [get_nets n32]
set_load 0.12428  [get_nets n5]
set_load 0.363765  [get_nets n31]
set_load 0.358904  [get_nets n30]
set_load 0.151045  [get_nets n29]
set_load 0.0777645  [get_nets n28]
set_load 0.0335933  [get_nets n26]
set_load 0.590973  [get_nets n27]
set_load 1.01433  [get_nets Output2]
set_load 0.848626  [get_nets Output1]
set_load 1.61798  [get_nets B]
set_load 1.64631  [get_nets A]
set_load 0.000323715  [get_nets Clock]
set_resistance 0.000119025  [get_nets Clock]
set_load 0.704012  [get_nets {Status[2]}]
set_load 1.37892  [get_nets {Status[1]}]
set_load 0.856612  [get_nets {Status[0]}]
