###################################################################

# Created by write_sdc on Thu Jun 8 16:26:17 2023

###################################################################
set sdc_version 1.7

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_operating_conditions -max slow -max_library stdcells-wc.db:NangateOpenCellLibrary -min fast -min_library stdcells-bc.db:NangateOpenCellLibrary
set_max_fanout 32 [current_design]
set_max_transition 1 [current_design]
set_load -pin_load 24.6946 [get_ports busy_o]
set_load -pin_load 24.6946 [get_ports writeback_valid_o]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[31]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[30]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[29]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[28]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[27]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[26]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[25]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[24]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[23]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[22]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[21]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[20]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[19]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[18]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[17]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[16]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[15]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[14]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[13]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[12]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[11]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[10]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[9]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[8]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[7]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[6]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[5]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[4]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[3]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[2]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[1]}]
set_load -pin_load 24.6946 [get_ports {writeback_value_o[0]}]
set_load -pin_load 24.6946 [get_ports {rob_idx_o[4]}]
set_load -pin_load 24.6946 [get_ports {rob_idx_o[3]}]
set_load -pin_load 24.6946 [get_ports {rob_idx_o[2]}]
set_load -pin_load 24.6946 [get_ports {rob_idx_o[1]}]
set_load -pin_load 24.6946 [get_ports {rob_idx_o[0]}]
set_load -pin_load 24.6946 [get_ports dmem_csb_write_o]
set_load -pin_load 24.6946 [get_ports {dmem_wmask_o[3]}]
set_load -pin_load 24.6946 [get_ports {dmem_wmask_o[2]}]
set_load -pin_load 24.6946 [get_ports {dmem_wmask_o[1]}]
set_load -pin_load 24.6946 [get_ports {dmem_wmask_o[0]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[7]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[6]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[5]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[4]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[3]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[2]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[1]}]
set_load -pin_load 24.6946 [get_ports {dmem_waddr_o[0]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[31]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[30]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[29]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[28]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[27]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[26]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[25]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[24]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[23]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[22]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[21]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[20]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[19]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[18]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[17]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[16]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[15]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[14]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[13]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[12]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[11]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[10]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[9]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[8]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[7]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[6]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[5]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[4]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[3]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[2]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[1]}]
set_load -pin_load 24.6946 [get_ports {dmem_din_o[0]}]
set_load -pin_load 24.6946 [get_ports dmem_csb_read_o]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[7]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[6]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[5]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[4]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[3]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[2]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[1]}]
set_load -pin_load 24.6946 [get_ports {dmem_raddr_o[0]}]
set_ideal_network -no_propagate  [get_ports reset_i]
set_timing_derate -late -net_delay 1 
set_timing_derate -early -net_delay 0.8 
set_timing_derate -late -cell_delay 1 
set_timing_derate -early -cell_delay 0.8 
create_clock [get_ports clk_i]  -period 10  -waveform {0 5}
set_clock_uncertainty -setup 0.05  [get_clocks clk_i]
set_clock_uncertainty -hold 0.01  [get_clocks clk_i]
set_clock_transition -min -fall 0.05 [get_clocks clk_i]
set_clock_transition -min -rise 0.05 [get_clocks clk_i]
set_clock_transition -max -fall 0.05 [get_clocks clk_i]
set_clock_transition -max -rise 0.05 [get_clocks clk_i]
group_path -name Feedthroughs  -from [list [get_ports reset_i] [get_ports {pc_i[31]}] [get_ports {pc_i[30]}] [get_ports {pc_i[29]}] [get_ports {pc_i[28]}] [get_ports {pc_i[27]}] [get_ports {pc_i[26]}] [get_ports {pc_i[25]}] [get_ports {pc_i[24]}] [get_ports {pc_i[23]}] [get_ports {pc_i[22]}] [get_ports {pc_i[21]}] [get_ports {pc_i[20]}] [get_ports {pc_i[19]}] [get_ports {pc_i[18]}] [get_ports {pc_i[17]}] [get_ports {pc_i[16]}] [get_ports {pc_i[15]}] [get_ports {pc_i[14]}] [get_ports {pc_i[13]}] [get_ports {pc_i[12]}] [get_ports {pc_i[11]}] [get_ports {pc_i[10]}] [get_ports {pc_i[9]}] [get_ports {pc_i[8]}] [get_ports {pc_i[7]}] [get_ports {pc_i[6]}] [get_ports {pc_i[5]}] [get_ports {pc_i[4]}] [get_ports {pc_i[3]}] [get_ports {pc_i[2]}] [get_ports {pc_i[1]}] [get_ports {pc_i[0]}] [get_ports lsu_request_i] [get_ports {inst_i[31]}] [get_ports {inst_i[30]}] [get_ports {inst_i[29]}] [get_ports {inst_i[28]}] [get_ports {inst_i[27]}] [get_ports {inst_i[26]}] [get_ports {inst_i[25]}] [get_ports {inst_i[24]}] [get_ports {inst_i[23]}] [get_ports {inst_i[22]}] [get_ports {inst_i[21]}] [get_ports {inst_i[20]}] [get_ports {inst_i[19]}] [get_ports {inst_i[18]}] [get_ports {inst_i[17]}] [get_ports {inst_i[16]}] [get_ports {inst_i[15]}] [get_ports {inst_i[14]}] [get_ports {inst_i[13]}] [get_ports {inst_i[12]}] [get_ports {inst_i[11]}] [get_ports {inst_i[10]}] [get_ports {inst_i[9]}] [get_ports {inst_i[8]}] [get_ports {inst_i[7]}] [get_ports {inst_i[6]}] [get_ports {inst_i[5]}] [get_ports {inst_i[4]}] [get_ports {inst_i[3]}] [get_ports {inst_i[2]}] [get_ports {inst_i[1]}] [get_ports {inst_i[0]}] [get_ports {rs1_value_i[31]}] [get_ports {rs1_value_i[30]}] [get_ports {rs1_value_i[29]}] [get_ports {rs1_value_i[28]}] [get_ports {rs1_value_i[27]}] [get_ports {rs1_value_i[26]}] [get_ports {rs1_value_i[25]}] [get_ports {rs1_value_i[24]}] [get_ports {rs1_value_i[23]}] [get_ports {rs1_value_i[22]}] [get_ports {rs1_value_i[21]}] [get_ports {rs1_value_i[20]}] [get_ports {rs1_value_i[19]}] [get_ports {rs1_value_i[18]}] [get_ports {rs1_value_i[17]}] [get_ports {rs1_value_i[16]}] [get_ports {rs1_value_i[15]}] [get_ports {rs1_value_i[14]}] [get_ports {rs1_value_i[13]}] [get_ports {rs1_value_i[12]}] [get_ports {rs1_value_i[11]}] [get_ports {rs1_value_i[10]}] [get_ports {rs1_value_i[9]}] [get_ports {rs1_value_i[8]}] [get_ports {rs1_value_i[7]}] [get_ports {rs1_value_i[6]}] [get_ports {rs1_value_i[5]}] [get_ports {rs1_value_i[4]}] [get_ports {rs1_value_i[3]}] [get_ports {rs1_value_i[2]}] [get_ports {rs1_value_i[1]}] [get_ports {rs1_value_i[0]}] [get_ports {rs2_value_i[31]}] [get_ports {rs2_value_i[30]}] [get_ports {rs2_value_i[29]}] [get_ports {rs2_value_i[28]}] [get_ports {rs2_value_i[27]}] [get_ports {rs2_value_i[26]}] [get_ports {rs2_value_i[25]}] [get_ports {rs2_value_i[24]}] [get_ports {rs2_value_i[23]}] [get_ports {rs2_value_i[22]}] [get_ports {rs2_value_i[21]}] [get_ports {rs2_value_i[20]}] [get_ports {rs2_value_i[19]}] [get_ports {rs2_value_i[18]}] [get_ports {rs2_value_i[17]}] [get_ports {rs2_value_i[16]}] [get_ports {rs2_value_i[15]}] [get_ports {rs2_value_i[14]}] [get_ports {rs2_value_i[13]}] [get_ports {rs2_value_i[12]}] [get_ports {rs2_value_i[11]}] [get_ports {rs2_value_i[10]}] [get_ports {rs2_value_i[9]}] [get_ports {rs2_value_i[8]}] [get_ports {rs2_value_i[7]}] [get_ports {rs2_value_i[6]}] [get_ports {rs2_value_i[5]}] [get_ports {rs2_value_i[4]}] [get_ports {rs2_value_i[3]}] [get_ports {rs2_value_i[2]}] [get_ports {rs2_value_i[1]}] [get_ports {rs2_value_i[0]}] [get_ports {rob_idx_i[4]}] [get_ports {rob_idx_i[3]}] [get_ports {rob_idx_i[2]}] [get_ports {rob_idx_i[1]}] [get_ports {rob_idx_i[0]}] [get_ports {dmem_dout_i[31]}] [get_ports {dmem_dout_i[30]}] [get_ports {dmem_dout_i[29]}] [get_ports {dmem_dout_i[28]}] [get_ports {dmem_dout_i[27]}] [get_ports {dmem_dout_i[26]}] [get_ports {dmem_dout_i[25]}] [get_ports {dmem_dout_i[24]}] [get_ports {dmem_dout_i[23]}] [get_ports {dmem_dout_i[22]}] [get_ports {dmem_dout_i[21]}] [get_ports {dmem_dout_i[20]}] [get_ports {dmem_dout_i[19]}] [get_ports {dmem_dout_i[18]}] [get_ports {dmem_dout_i[17]}] [get_ports {dmem_dout_i[16]}] [get_ports {dmem_dout_i[15]}] [get_ports {dmem_dout_i[14]}] [get_ports {dmem_dout_i[13]}] [get_ports {dmem_dout_i[12]}] [get_ports {dmem_dout_i[11]}] [get_ports {dmem_dout_i[10]}] [get_ports {dmem_dout_i[9]}] [get_ports {dmem_dout_i[8]}] [get_ports {dmem_dout_i[7]}] [get_ports {dmem_dout_i[6]}] [get_ports {dmem_dout_i[5]}] [get_ports {dmem_dout_i[4]}] [get_ports {dmem_dout_i[3]}] [get_ports {dmem_dout_i[2]}] [get_ports {dmem_dout_i[1]}] [get_ports {dmem_dout_i[0]}]]  -to [list [get_ports busy_o] [get_ports writeback_valid_o] [get_ports {writeback_value_o[31]}] [get_ports {writeback_value_o[30]}] [get_ports {writeback_value_o[29]}] [get_ports {writeback_value_o[28]}] [get_ports {writeback_value_o[27]}] [get_ports {writeback_value_o[26]}] [get_ports {writeback_value_o[25]}] [get_ports {writeback_value_o[24]}] [get_ports {writeback_value_o[23]}] [get_ports {writeback_value_o[22]}] [get_ports {writeback_value_o[21]}] [get_ports {writeback_value_o[20]}] [get_ports {writeback_value_o[19]}] [get_ports {writeback_value_o[18]}] [get_ports {writeback_value_o[17]}] [get_ports {writeback_value_o[16]}] [get_ports {writeback_value_o[15]}] [get_ports {writeback_value_o[14]}] [get_ports {writeback_value_o[13]}] [get_ports {writeback_value_o[12]}] [get_ports {writeback_value_o[11]}] [get_ports {writeback_value_o[10]}] [get_ports {writeback_value_o[9]}] [get_ports {writeback_value_o[8]}] [get_ports {writeback_value_o[7]}] [get_ports {writeback_value_o[6]}] [get_ports {writeback_value_o[5]}] [get_ports {writeback_value_o[4]}] [get_ports {writeback_value_o[3]}] [get_ports {writeback_value_o[2]}] [get_ports {writeback_value_o[1]}] [get_ports {writeback_value_o[0]}] [get_ports {rob_idx_o[4]}] [get_ports {rob_idx_o[3]}] [get_ports {rob_idx_o[2]}] [get_ports {rob_idx_o[1]}] [get_ports {rob_idx_o[0]}] [get_ports dmem_csb_write_o] [get_ports {dmem_wmask_o[3]}] [get_ports {dmem_wmask_o[2]}] [get_ports {dmem_wmask_o[1]}] [get_ports {dmem_wmask_o[0]}] [get_ports {dmem_waddr_o[7]}] [get_ports {dmem_waddr_o[6]}] [get_ports {dmem_waddr_o[5]}] [get_ports {dmem_waddr_o[4]}] [get_ports {dmem_waddr_o[3]}] [get_ports {dmem_waddr_o[2]}] [get_ports {dmem_waddr_o[1]}] [get_ports {dmem_waddr_o[0]}] [get_ports {dmem_din_o[31]}] [get_ports {dmem_din_o[30]}] [get_ports {dmem_din_o[29]}] [get_ports {dmem_din_o[28]}] [get_ports {dmem_din_o[27]}] [get_ports {dmem_din_o[26]}] [get_ports {dmem_din_o[25]}] [get_ports {dmem_din_o[24]}] [get_ports {dmem_din_o[23]}] [get_ports {dmem_din_o[22]}] [get_ports {dmem_din_o[21]}] [get_ports {dmem_din_o[20]}] [get_ports {dmem_din_o[19]}] [get_ports {dmem_din_o[18]}] [get_ports {dmem_din_o[17]}] [get_ports {dmem_din_o[16]}] [get_ports {dmem_din_o[15]}] [get_ports {dmem_din_o[14]}] [get_ports {dmem_din_o[13]}] [get_ports {dmem_din_o[12]}] [get_ports {dmem_din_o[11]}] [get_ports {dmem_din_o[10]}] [get_ports {dmem_din_o[9]}] [get_ports {dmem_din_o[8]}] [get_ports {dmem_din_o[7]}] [get_ports {dmem_din_o[6]}] [get_ports {dmem_din_o[5]}] [get_ports {dmem_din_o[4]}] [get_ports {dmem_din_o[3]}] [get_ports {dmem_din_o[2]}] [get_ports {dmem_din_o[1]}] [get_ports {dmem_din_o[0]}] [get_ports dmem_csb_read_o] [get_ports {dmem_raddr_o[7]}] [get_ports {dmem_raddr_o[6]}] [get_ports {dmem_raddr_o[5]}] [get_ports {dmem_raddr_o[4]}] [get_ports {dmem_raddr_o[3]}] [get_ports {dmem_raddr_o[2]}] [get_ports {dmem_raddr_o[1]}] [get_ports {dmem_raddr_o[0]}]]
group_path -name Inputs  -from [list [get_ports reset_i] [get_ports {pc_i[31]}] [get_ports {pc_i[30]}] [get_ports {pc_i[29]}] [get_ports {pc_i[28]}] [get_ports {pc_i[27]}] [get_ports {pc_i[26]}] [get_ports {pc_i[25]}] [get_ports {pc_i[24]}] [get_ports {pc_i[23]}] [get_ports {pc_i[22]}] [get_ports {pc_i[21]}] [get_ports {pc_i[20]}] [get_ports {pc_i[19]}] [get_ports {pc_i[18]}] [get_ports {pc_i[17]}] [get_ports {pc_i[16]}] [get_ports {pc_i[15]}] [get_ports {pc_i[14]}] [get_ports {pc_i[13]}] [get_ports {pc_i[12]}] [get_ports {pc_i[11]}] [get_ports {pc_i[10]}] [get_ports {pc_i[9]}] [get_ports {pc_i[8]}] [get_ports {pc_i[7]}] [get_ports {pc_i[6]}] [get_ports {pc_i[5]}] [get_ports {pc_i[4]}] [get_ports {pc_i[3]}] [get_ports {pc_i[2]}] [get_ports {pc_i[1]}] [get_ports {pc_i[0]}] [get_ports lsu_request_i] [get_ports {inst_i[31]}] [get_ports {inst_i[30]}] [get_ports {inst_i[29]}] [get_ports {inst_i[28]}] [get_ports {inst_i[27]}] [get_ports {inst_i[26]}] [get_ports {inst_i[25]}] [get_ports {inst_i[24]}] [get_ports {inst_i[23]}] [get_ports {inst_i[22]}] [get_ports {inst_i[21]}] [get_ports {inst_i[20]}] [get_ports {inst_i[19]}] [get_ports {inst_i[18]}] [get_ports {inst_i[17]}] [get_ports {inst_i[16]}] [get_ports {inst_i[15]}] [get_ports {inst_i[14]}] [get_ports {inst_i[13]}] [get_ports {inst_i[12]}] [get_ports {inst_i[11]}] [get_ports {inst_i[10]}] [get_ports {inst_i[9]}] [get_ports {inst_i[8]}] [get_ports {inst_i[7]}] [get_ports {inst_i[6]}] [get_ports {inst_i[5]}] [get_ports {inst_i[4]}] [get_ports {inst_i[3]}] [get_ports {inst_i[2]}] [get_ports {inst_i[1]}] [get_ports {inst_i[0]}] [get_ports {rs1_value_i[31]}] [get_ports {rs1_value_i[30]}] [get_ports {rs1_value_i[29]}] [get_ports {rs1_value_i[28]}] [get_ports {rs1_value_i[27]}] [get_ports {rs1_value_i[26]}] [get_ports {rs1_value_i[25]}] [get_ports {rs1_value_i[24]}] [get_ports {rs1_value_i[23]}] [get_ports {rs1_value_i[22]}] [get_ports {rs1_value_i[21]}] [get_ports {rs1_value_i[20]}] [get_ports {rs1_value_i[19]}] [get_ports {rs1_value_i[18]}] [get_ports {rs1_value_i[17]}] [get_ports {rs1_value_i[16]}] [get_ports {rs1_value_i[15]}] [get_ports {rs1_value_i[14]}] [get_ports {rs1_value_i[13]}] [get_ports {rs1_value_i[12]}] [get_ports {rs1_value_i[11]}] [get_ports {rs1_value_i[10]}] [get_ports {rs1_value_i[9]}] [get_ports {rs1_value_i[8]}] [get_ports {rs1_value_i[7]}] [get_ports {rs1_value_i[6]}] [get_ports {rs1_value_i[5]}] [get_ports {rs1_value_i[4]}] [get_ports {rs1_value_i[3]}] [get_ports {rs1_value_i[2]}] [get_ports {rs1_value_i[1]}] [get_ports {rs1_value_i[0]}] [get_ports {rs2_value_i[31]}] [get_ports {rs2_value_i[30]}] [get_ports {rs2_value_i[29]}] [get_ports {rs2_value_i[28]}] [get_ports {rs2_value_i[27]}] [get_ports {rs2_value_i[26]}] [get_ports {rs2_value_i[25]}] [get_ports {rs2_value_i[24]}] [get_ports {rs2_value_i[23]}] [get_ports {rs2_value_i[22]}] [get_ports {rs2_value_i[21]}] [get_ports {rs2_value_i[20]}] [get_ports {rs2_value_i[19]}] [get_ports {rs2_value_i[18]}] [get_ports {rs2_value_i[17]}] [get_ports {rs2_value_i[16]}] [get_ports {rs2_value_i[15]}] [get_ports {rs2_value_i[14]}] [get_ports {rs2_value_i[13]}] [get_ports {rs2_value_i[12]}] [get_ports {rs2_value_i[11]}] [get_ports {rs2_value_i[10]}] [get_ports {rs2_value_i[9]}] [get_ports {rs2_value_i[8]}] [get_ports {rs2_value_i[7]}] [get_ports {rs2_value_i[6]}] [get_ports {rs2_value_i[5]}] [get_ports {rs2_value_i[4]}] [get_ports {rs2_value_i[3]}] [get_ports {rs2_value_i[2]}] [get_ports {rs2_value_i[1]}] [get_ports {rs2_value_i[0]}] [get_ports {rob_idx_i[4]}] [get_ports {rob_idx_i[3]}] [get_ports {rob_idx_i[2]}] [get_ports {rob_idx_i[1]}] [get_ports {rob_idx_i[0]}] [get_ports {dmem_dout_i[31]}] [get_ports {dmem_dout_i[30]}] [get_ports {dmem_dout_i[29]}] [get_ports {dmem_dout_i[28]}] [get_ports {dmem_dout_i[27]}] [get_ports {dmem_dout_i[26]}] [get_ports {dmem_dout_i[25]}] [get_ports {dmem_dout_i[24]}] [get_ports {dmem_dout_i[23]}] [get_ports {dmem_dout_i[22]}] [get_ports {dmem_dout_i[21]}] [get_ports {dmem_dout_i[20]}] [get_ports {dmem_dout_i[19]}] [get_ports {dmem_dout_i[18]}] [get_ports {dmem_dout_i[17]}] [get_ports {dmem_dout_i[16]}] [get_ports {dmem_dout_i[15]}] [get_ports {dmem_dout_i[14]}] [get_ports {dmem_dout_i[13]}] [get_ports {dmem_dout_i[12]}] [get_ports {dmem_dout_i[11]}] [get_ports {dmem_dout_i[10]}] [get_ports {dmem_dout_i[9]}] [get_ports {dmem_dout_i[8]}] [get_ports {dmem_dout_i[7]}] [get_ports {dmem_dout_i[6]}] [get_ports {dmem_dout_i[5]}] [get_ports {dmem_dout_i[4]}] [get_ports {dmem_dout_i[3]}] [get_ports {dmem_dout_i[2]}] [get_ports {dmem_dout_i[1]}] [get_ports {dmem_dout_i[0]}]]
group_path -name Outputs  -to [list [get_ports busy_o] [get_ports writeback_valid_o] [get_ports {writeback_value_o[31]}] [get_ports {writeback_value_o[30]}] [get_ports {writeback_value_o[29]}] [get_ports {writeback_value_o[28]}] [get_ports {writeback_value_o[27]}] [get_ports {writeback_value_o[26]}] [get_ports {writeback_value_o[25]}] [get_ports {writeback_value_o[24]}] [get_ports {writeback_value_o[23]}] [get_ports {writeback_value_o[22]}] [get_ports {writeback_value_o[21]}] [get_ports {writeback_value_o[20]}] [get_ports {writeback_value_o[19]}] [get_ports {writeback_value_o[18]}] [get_ports {writeback_value_o[17]}] [get_ports {writeback_value_o[16]}] [get_ports {writeback_value_o[15]}] [get_ports {writeback_value_o[14]}] [get_ports {writeback_value_o[13]}] [get_ports {writeback_value_o[12]}] [get_ports {writeback_value_o[11]}] [get_ports {writeback_value_o[10]}] [get_ports {writeback_value_o[9]}] [get_ports {writeback_value_o[8]}] [get_ports {writeback_value_o[7]}] [get_ports {writeback_value_o[6]}] [get_ports {writeback_value_o[5]}] [get_ports {writeback_value_o[4]}] [get_ports {writeback_value_o[3]}] [get_ports {writeback_value_o[2]}] [get_ports {writeback_value_o[1]}] [get_ports {writeback_value_o[0]}] [get_ports {rob_idx_o[4]}] [get_ports {rob_idx_o[3]}] [get_ports {rob_idx_o[2]}] [get_ports {rob_idx_o[1]}] [get_ports {rob_idx_o[0]}] [get_ports dmem_csb_write_o] [get_ports {dmem_wmask_o[3]}] [get_ports {dmem_wmask_o[2]}] [get_ports {dmem_wmask_o[1]}] [get_ports {dmem_wmask_o[0]}] [get_ports {dmem_waddr_o[7]}] [get_ports {dmem_waddr_o[6]}] [get_ports {dmem_waddr_o[5]}] [get_ports {dmem_waddr_o[4]}] [get_ports {dmem_waddr_o[3]}] [get_ports {dmem_waddr_o[2]}] [get_ports {dmem_waddr_o[1]}] [get_ports {dmem_waddr_o[0]}] [get_ports {dmem_din_o[31]}] [get_ports {dmem_din_o[30]}] [get_ports {dmem_din_o[29]}] [get_ports {dmem_din_o[28]}] [get_ports {dmem_din_o[27]}] [get_ports {dmem_din_o[26]}] [get_ports {dmem_din_o[25]}] [get_ports {dmem_din_o[24]}] [get_ports {dmem_din_o[23]}] [get_ports {dmem_din_o[22]}] [get_ports {dmem_din_o[21]}] [get_ports {dmem_din_o[20]}] [get_ports {dmem_din_o[19]}] [get_ports {dmem_din_o[18]}] [get_ports {dmem_din_o[17]}] [get_ports {dmem_din_o[16]}] [get_ports {dmem_din_o[15]}] [get_ports {dmem_din_o[14]}] [get_ports {dmem_din_o[13]}] [get_ports {dmem_din_o[12]}] [get_ports {dmem_din_o[11]}] [get_ports {dmem_din_o[10]}] [get_ports {dmem_din_o[9]}] [get_ports {dmem_din_o[8]}] [get_ports {dmem_din_o[7]}] [get_ports {dmem_din_o[6]}] [get_ports {dmem_din_o[5]}] [get_ports {dmem_din_o[4]}] [get_ports {dmem_din_o[3]}] [get_ports {dmem_din_o[2]}] [get_ports {dmem_din_o[1]}] [get_ports {dmem_din_o[0]}] [get_ports dmem_csb_read_o] [get_ports {dmem_raddr_o[7]}] [get_ports {dmem_raddr_o[6]}] [get_ports {dmem_raddr_o[5]}] [get_ports {dmem_raddr_o[4]}] [get_ports {dmem_raddr_o[3]}] [get_ports {dmem_raddr_o[2]}] [get_ports {dmem_raddr_o[1]}] [get_ports {dmem_raddr_o[0]}]]
group_path -name Regs_to_Regs  -from [list [get_cells lsu_fifo/mem_reg_3__1_] [get_cells lsu_fifo/mem_reg_3__2_] [get_cells lsu_fifo/mem_reg_3__3_] [get_cells lsu_fifo/mem_reg_3__4_] [get_cells lsu_fifo/mem_reg_3__5_] [get_cells lsu_fifo/mem_reg_3__6_] [get_cells lsu_fifo/mem_reg_3__7_] [get_cells lsu_fifo/mem_reg_3__8_] [get_cells lsu_fifo/mem_reg_3__9_] [get_cells lsu_fifo/mem_reg_3__10_] [get_cells lsu_fifo/mem_reg_3__11_] [get_cells lsu_fifo/mem_reg_2__1_] [get_cells lsu_fifo/mem_reg_2__2_] [get_cells lsu_fifo/mem_reg_2__3_] [get_cells lsu_fifo/mem_reg_2__4_] [get_cells lsu_fifo/mem_reg_2__5_] [get_cells lsu_fifo/mem_reg_2__6_] [get_cells lsu_fifo/mem_reg_2__7_] [get_cells lsu_fifo/mem_reg_2__8_] [get_cells lsu_fifo/mem_reg_2__9_] [get_cells lsu_fifo/mem_reg_2__10_] [get_cells lsu_fifo/mem_reg_2__11_] [get_cells lsu_fifo/mem_reg_1__1_] [get_cells lsu_fifo/mem_reg_1__2_] [get_cells lsu_fifo/mem_reg_1__3_] [get_cells lsu_fifo/mem_reg_1__4_] [get_cells lsu_fifo/mem_reg_1__5_] [get_cells lsu_fifo/mem_reg_1__6_] [get_cells lsu_fifo/mem_reg_1__7_] [get_cells lsu_fifo/mem_reg_1__8_] [get_cells lsu_fifo/mem_reg_1__9_] [get_cells lsu_fifo/mem_reg_1__10_] [get_cells lsu_fifo/mem_reg_1__11_] [get_cells lsu_fifo/mem_reg_0__1_] [get_cells lsu_fifo/mem_reg_0__2_] [get_cells lsu_fifo/mem_reg_0__3_] [get_cells lsu_fifo/mem_reg_0__4_] [get_cells lsu_fifo/mem_reg_0__5_] [get_cells lsu_fifo/mem_reg_0__6_] [get_cells lsu_fifo/mem_reg_0__7_] [get_cells lsu_fifo/mem_reg_0__8_] [get_cells lsu_fifo/mem_reg_0__9_] [get_cells lsu_fifo/mem_reg_0__10_] [get_cells lsu_fifo/mem_reg_0__11_] [get_cells lsu_fifo/wr_ptr_reg_0_] [get_cells lsu_fifo/wr_ptr_reg_1_] [get_cells lsu_fifo/rd_ptr_reg_0_] [get_cells lsu_fifo/rd_ptr_reg_1_] [get_cells mem_load_success_reg] [get_cells rob_idx_o_reg_0_] [get_cells rob_idx_o_reg_1_] [get_cells rob_idx_o_reg_2_] [get_cells rob_idx_o_reg_3_] [get_cells rob_idx_o_reg_4_]]  -to [list [get_cells lsu_fifo/mem_reg_3__1_] [get_cells lsu_fifo/mem_reg_3__2_] [get_cells lsu_fifo/mem_reg_3__3_] [get_cells lsu_fifo/mem_reg_3__4_] [get_cells lsu_fifo/mem_reg_3__5_] [get_cells lsu_fifo/mem_reg_3__6_] [get_cells lsu_fifo/mem_reg_3__7_] [get_cells lsu_fifo/mem_reg_3__8_] [get_cells lsu_fifo/mem_reg_3__9_] [get_cells lsu_fifo/mem_reg_3__10_] [get_cells lsu_fifo/mem_reg_3__11_] [get_cells lsu_fifo/mem_reg_2__1_] [get_cells lsu_fifo/mem_reg_2__2_] [get_cells lsu_fifo/mem_reg_2__3_] [get_cells lsu_fifo/mem_reg_2__4_] [get_cells lsu_fifo/mem_reg_2__5_] [get_cells lsu_fifo/mem_reg_2__6_] [get_cells lsu_fifo/mem_reg_2__7_] [get_cells lsu_fifo/mem_reg_2__8_] [get_cells lsu_fifo/mem_reg_2__9_] [get_cells lsu_fifo/mem_reg_2__10_] [get_cells lsu_fifo/mem_reg_2__11_] [get_cells lsu_fifo/mem_reg_1__1_] [get_cells lsu_fifo/mem_reg_1__2_] [get_cells lsu_fifo/mem_reg_1__3_] [get_cells lsu_fifo/mem_reg_1__4_] [get_cells lsu_fifo/mem_reg_1__5_] [get_cells lsu_fifo/mem_reg_1__6_] [get_cells lsu_fifo/mem_reg_1__7_] [get_cells lsu_fifo/mem_reg_1__8_] [get_cells lsu_fifo/mem_reg_1__9_] [get_cells lsu_fifo/mem_reg_1__10_] [get_cells lsu_fifo/mem_reg_1__11_] [get_cells lsu_fifo/mem_reg_0__1_] [get_cells lsu_fifo/mem_reg_0__2_] [get_cells lsu_fifo/mem_reg_0__3_] [get_cells lsu_fifo/mem_reg_0__4_] [get_cells lsu_fifo/mem_reg_0__5_] [get_cells lsu_fifo/mem_reg_0__6_] [get_cells lsu_fifo/mem_reg_0__7_] [get_cells lsu_fifo/mem_reg_0__8_] [get_cells lsu_fifo/mem_reg_0__9_] [get_cells lsu_fifo/mem_reg_0__10_] [get_cells lsu_fifo/mem_reg_0__11_] [get_cells lsu_fifo/wr_ptr_reg_0_] [get_cells lsu_fifo/wr_ptr_reg_1_] [get_cells lsu_fifo/rd_ptr_reg_0_] [get_cells lsu_fifo/rd_ptr_reg_1_] [get_cells mem_load_success_reg] [get_cells rob_idx_o_reg_0_] [get_cells rob_idx_o_reg_1_] [get_cells rob_idx_o_reg_2_] [get_cells rob_idx_o_reg_3_] [get_cells rob_idx_o_reg_4_]]
set_input_delay -clock clk_i  0.1  [get_ports reset_i]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[31]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[30]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[29]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[28]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[27]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[26]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[25]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[24]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[23]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[22]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[21]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[20]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[19]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[18]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[17]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[16]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[15]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[14]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[13]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[12]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[11]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[10]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[9]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[8]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[7]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[6]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[5]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[4]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[3]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[2]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[1]}]
set_input_delay -clock clk_i  0.1  [get_ports {pc_i[0]}]
set_input_delay -clock clk_i  0.1  [get_ports lsu_request_i]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[31]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[30]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[29]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[28]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[27]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[26]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[25]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[24]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[23]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[22]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[21]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[20]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[19]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[18]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[17]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[16]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[15]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[14]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[13]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[12]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[11]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[10]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[9]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[8]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[7]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[6]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[5]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[4]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[3]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[2]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[1]}]
set_input_delay -clock clk_i  0.1  [get_ports {inst_i[0]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[31]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[30]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[29]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[28]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[27]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[26]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[25]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[24]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[23]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[22]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[21]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[20]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[19]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[18]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[17]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[16]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[15]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[14]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[13]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[12]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[11]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[10]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[9]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[8]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[7]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[6]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[5]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[4]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[3]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[2]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[1]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs1_value_i[0]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[31]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[30]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[29]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[28]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[27]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[26]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[25]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[24]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[23]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[22]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[21]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[20]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[19]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[18]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[17]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[16]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[15]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[14]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[13]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[12]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[11]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[10]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[9]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[8]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[7]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[6]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[5]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[4]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[3]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[2]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[1]}]
set_input_delay -clock clk_i  0.1  [get_ports {rs2_value_i[0]}]
set_input_delay -clock clk_i  0.1  [get_ports {rob_idx_i[4]}]
set_input_delay -clock clk_i  0.1  [get_ports {rob_idx_i[3]}]
set_input_delay -clock clk_i  0.1  [get_ports {rob_idx_i[2]}]
set_input_delay -clock clk_i  0.1  [get_ports {rob_idx_i[1]}]
set_input_delay -clock clk_i  0.1  [get_ports {rob_idx_i[0]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[31]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[30]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[29]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[28]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[27]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[26]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[25]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[24]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[23]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[22]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[21]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[20]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[19]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[18]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[17]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[16]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[15]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[14]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[13]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[12]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[11]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[10]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[9]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[8]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[7]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[6]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[5]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[4]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[3]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[2]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[1]}]
set_input_delay -clock clk_i  0.1  [get_ports {dmem_dout_i[0]}]
set_output_delay -clock clk_i  0.1  [get_ports busy_o]
set_output_delay -clock clk_i  0.1  [get_ports writeback_valid_o]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[31]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[30]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[29]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[28]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[27]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[26]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[25]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[24]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[23]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[22]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[21]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[20]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[19]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[18]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[17]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[16]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[15]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[14]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[13]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[12]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[11]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[10]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[9]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[8]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[7]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[6]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[5]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[4]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[3]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[2]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[1]}]
set_output_delay -clock clk_i  0.1  [get_ports {writeback_value_o[0]}]
set_output_delay -clock clk_i  0.1  [get_ports {rob_idx_o[4]}]
set_output_delay -clock clk_i  0.1  [get_ports {rob_idx_o[3]}]
set_output_delay -clock clk_i  0.1  [get_ports {rob_idx_o[2]}]
set_output_delay -clock clk_i  0.1  [get_ports {rob_idx_o[1]}]
set_output_delay -clock clk_i  0.1  [get_ports {rob_idx_o[0]}]
set_output_delay -clock clk_i  0.1  [get_ports dmem_csb_write_o]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_wmask_o[3]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_wmask_o[2]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_wmask_o[1]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_wmask_o[0]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_waddr_o[7]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_waddr_o[6]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_waddr_o[5]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_waddr_o[4]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_waddr_o[3]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_waddr_o[2]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_waddr_o[1]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_waddr_o[0]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[31]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[30]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[29]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[28]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[27]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[26]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[25]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[24]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[23]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[22]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[21]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[20]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[19]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[18]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[17]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[16]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[15]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[14]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[13]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[12]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[11]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[10]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[9]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[8]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[7]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[6]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[5]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[4]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[3]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[2]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[1]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_din_o[0]}]
set_output_delay -clock clk_i  0.1  [get_ports dmem_csb_read_o]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_raddr_o[7]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_raddr_o[6]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_raddr_o[5]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_raddr_o[4]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_raddr_o[3]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_raddr_o[2]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_raddr_o[1]}]
set_output_delay -clock clk_i  0.1  [get_ports {dmem_raddr_o[0]}]
set_drive 0.00865463  [get_ports clk_i]
set_drive 0.00865463  [get_ports reset_i]
set_drive 0.00865463  [get_ports {pc_i[31]}]
set_drive 0.00865463  [get_ports {pc_i[30]}]
set_drive 0.00865463  [get_ports {pc_i[29]}]
set_drive 0.00865463  [get_ports {pc_i[28]}]
set_drive 0.00865463  [get_ports {pc_i[27]}]
set_drive 0.00865463  [get_ports {pc_i[26]}]
set_drive 0.00865463  [get_ports {pc_i[25]}]
set_drive 0.00865463  [get_ports {pc_i[24]}]
set_drive 0.00865463  [get_ports {pc_i[23]}]
set_drive 0.00865463  [get_ports {pc_i[22]}]
set_drive 0.00865463  [get_ports {pc_i[21]}]
set_drive 0.00865463  [get_ports {pc_i[20]}]
set_drive 0.00865463  [get_ports {pc_i[19]}]
set_drive 0.00865463  [get_ports {pc_i[18]}]
set_drive 0.00865463  [get_ports {pc_i[17]}]
set_drive 0.00865463  [get_ports {pc_i[16]}]
set_drive 0.00865463  [get_ports {pc_i[15]}]
set_drive 0.00865463  [get_ports {pc_i[14]}]
set_drive 0.00865463  [get_ports {pc_i[13]}]
set_drive 0.00865463  [get_ports {pc_i[12]}]
set_drive 0.00865463  [get_ports {pc_i[11]}]
set_drive 0.00865463  [get_ports {pc_i[10]}]
set_drive 0.00865463  [get_ports {pc_i[9]}]
set_drive 0.00865463  [get_ports {pc_i[8]}]
set_drive 0.00865463  [get_ports {pc_i[7]}]
set_drive 0.00865463  [get_ports {pc_i[6]}]
set_drive 0.00865463  [get_ports {pc_i[5]}]
set_drive 0.00865463  [get_ports {pc_i[4]}]
set_drive 0.00865463  [get_ports {pc_i[3]}]
set_drive 0.00865463  [get_ports {pc_i[2]}]
set_drive 0.00865463  [get_ports {pc_i[1]}]
set_drive 0.00865463  [get_ports {pc_i[0]}]
set_drive 0.00865463  [get_ports lsu_request_i]
set_drive 0.00865463  [get_ports {inst_i[31]}]
set_drive 0.00865463  [get_ports {inst_i[30]}]
set_drive 0.00865463  [get_ports {inst_i[29]}]
set_drive 0.00865463  [get_ports {inst_i[28]}]
set_drive 0.00865463  [get_ports {inst_i[27]}]
set_drive 0.00865463  [get_ports {inst_i[26]}]
set_drive 0.00865463  [get_ports {inst_i[25]}]
set_drive 0.00865463  [get_ports {inst_i[24]}]
set_drive 0.00865463  [get_ports {inst_i[23]}]
set_drive 0.00865463  [get_ports {inst_i[22]}]
set_drive 0.00865463  [get_ports {inst_i[21]}]
set_drive 0.00865463  [get_ports {inst_i[20]}]
set_drive 0.00865463  [get_ports {inst_i[19]}]
set_drive 0.00865463  [get_ports {inst_i[18]}]
set_drive 0.00865463  [get_ports {inst_i[17]}]
set_drive 0.00865463  [get_ports {inst_i[16]}]
set_drive 0.00865463  [get_ports {inst_i[15]}]
set_drive 0.00865463  [get_ports {inst_i[14]}]
set_drive 0.00865463  [get_ports {inst_i[13]}]
set_drive 0.00865463  [get_ports {inst_i[12]}]
set_drive 0.00865463  [get_ports {inst_i[11]}]
set_drive 0.00865463  [get_ports {inst_i[10]}]
set_drive 0.00865463  [get_ports {inst_i[9]}]
set_drive 0.00865463  [get_ports {inst_i[8]}]
set_drive 0.00865463  [get_ports {inst_i[7]}]
set_drive 0.00865463  [get_ports {inst_i[6]}]
set_drive 0.00865463  [get_ports {inst_i[5]}]
set_drive 0.00865463  [get_ports {inst_i[4]}]
set_drive 0.00865463  [get_ports {inst_i[3]}]
set_drive 0.00865463  [get_ports {inst_i[2]}]
set_drive 0.00865463  [get_ports {inst_i[1]}]
set_drive 0.00865463  [get_ports {inst_i[0]}]
set_drive 0.00865463  [get_ports {rs1_value_i[31]}]
set_drive 0.00865463  [get_ports {rs1_value_i[30]}]
set_drive 0.00865463  [get_ports {rs1_value_i[29]}]
set_drive 0.00865463  [get_ports {rs1_value_i[28]}]
set_drive 0.00865463  [get_ports {rs1_value_i[27]}]
set_drive 0.00865463  [get_ports {rs1_value_i[26]}]
set_drive 0.00865463  [get_ports {rs1_value_i[25]}]
set_drive 0.00865463  [get_ports {rs1_value_i[24]}]
set_drive 0.00865463  [get_ports {rs1_value_i[23]}]
set_drive 0.00865463  [get_ports {rs1_value_i[22]}]
set_drive 0.00865463  [get_ports {rs1_value_i[21]}]
set_drive 0.00865463  [get_ports {rs1_value_i[20]}]
set_drive 0.00865463  [get_ports {rs1_value_i[19]}]
set_drive 0.00865463  [get_ports {rs1_value_i[18]}]
set_drive 0.00865463  [get_ports {rs1_value_i[17]}]
set_drive 0.00865463  [get_ports {rs1_value_i[16]}]
set_drive 0.00865463  [get_ports {rs1_value_i[15]}]
set_drive 0.00865463  [get_ports {rs1_value_i[14]}]
set_drive 0.00865463  [get_ports {rs1_value_i[13]}]
set_drive 0.00865463  [get_ports {rs1_value_i[12]}]
set_drive 0.00865463  [get_ports {rs1_value_i[11]}]
set_drive 0.00865463  [get_ports {rs1_value_i[10]}]
set_drive 0.00865463  [get_ports {rs1_value_i[9]}]
set_drive 0.00865463  [get_ports {rs1_value_i[8]}]
set_drive 0.00865463  [get_ports {rs1_value_i[7]}]
set_drive 0.00865463  [get_ports {rs1_value_i[6]}]
set_drive 0.00865463  [get_ports {rs1_value_i[5]}]
set_drive 0.00865463  [get_ports {rs1_value_i[4]}]
set_drive 0.00865463  [get_ports {rs1_value_i[3]}]
set_drive 0.00865463  [get_ports {rs1_value_i[2]}]
set_drive 0.00865463  [get_ports {rs1_value_i[1]}]
set_drive 0.00865463  [get_ports {rs1_value_i[0]}]
set_drive 0.00865463  [get_ports {rs2_value_i[31]}]
set_drive 0.00865463  [get_ports {rs2_value_i[30]}]
set_drive 0.00865463  [get_ports {rs2_value_i[29]}]
set_drive 0.00865463  [get_ports {rs2_value_i[28]}]
set_drive 0.00865463  [get_ports {rs2_value_i[27]}]
set_drive 0.00865463  [get_ports {rs2_value_i[26]}]
set_drive 0.00865463  [get_ports {rs2_value_i[25]}]
set_drive 0.00865463  [get_ports {rs2_value_i[24]}]
set_drive 0.00865463  [get_ports {rs2_value_i[23]}]
set_drive 0.00865463  [get_ports {rs2_value_i[22]}]
set_drive 0.00865463  [get_ports {rs2_value_i[21]}]
set_drive 0.00865463  [get_ports {rs2_value_i[20]}]
set_drive 0.00865463  [get_ports {rs2_value_i[19]}]
set_drive 0.00865463  [get_ports {rs2_value_i[18]}]
set_drive 0.00865463  [get_ports {rs2_value_i[17]}]
set_drive 0.00865463  [get_ports {rs2_value_i[16]}]
set_drive 0.00865463  [get_ports {rs2_value_i[15]}]
set_drive 0.00865463  [get_ports {rs2_value_i[14]}]
set_drive 0.00865463  [get_ports {rs2_value_i[13]}]
set_drive 0.00865463  [get_ports {rs2_value_i[12]}]
set_drive 0.00865463  [get_ports {rs2_value_i[11]}]
set_drive 0.00865463  [get_ports {rs2_value_i[10]}]
set_drive 0.00865463  [get_ports {rs2_value_i[9]}]
set_drive 0.00865463  [get_ports {rs2_value_i[8]}]
set_drive 0.00865463  [get_ports {rs2_value_i[7]}]
set_drive 0.00865463  [get_ports {rs2_value_i[6]}]
set_drive 0.00865463  [get_ports {rs2_value_i[5]}]
set_drive 0.00865463  [get_ports {rs2_value_i[4]}]
set_drive 0.00865463  [get_ports {rs2_value_i[3]}]
set_drive 0.00865463  [get_ports {rs2_value_i[2]}]
set_drive 0.00865463  [get_ports {rs2_value_i[1]}]
set_drive 0.00865463  [get_ports {rs2_value_i[0]}]
set_drive 0.00865463  [get_ports {rob_idx_i[4]}]
set_drive 0.00865463  [get_ports {rob_idx_i[3]}]
set_drive 0.00865463  [get_ports {rob_idx_i[2]}]
set_drive 0.00865463  [get_ports {rob_idx_i[1]}]
set_drive 0.00865463  [get_ports {rob_idx_i[0]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[31]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[30]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[29]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[28]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[27]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[26]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[25]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[24]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[23]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[22]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[21]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[20]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[19]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[18]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[17]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[16]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[15]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[14]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[13]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[12]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[11]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[10]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[9]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[8]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[7]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[6]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[5]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[4]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[3]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[2]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[1]}]
set_drive 0.00865463  [get_ports {dmem_dout_i[0]}]
