###################################################################

# Created by write_sdc on Tue Jun 6 21:41:04 2023

###################################################################
set sdc_version 1.7

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_operating_conditions -max slow -max_library stdcells-wc.db:NangateOpenCellLibrary -min fast -min_library stdcells-bc.db:NangateOpenCellLibrary
set_max_fanout 32 [current_design]
set_max_transition 1 [current_design]
set_load -pin_load 24.6946 [get_ports {pc_o[31]}]
set_load -pin_load 24.6946 [get_ports {pc_o[30]}]
set_load -pin_load 24.6946 [get_ports {pc_o[29]}]
set_load -pin_load 24.6946 [get_ports {pc_o[28]}]
set_load -pin_load 24.6946 [get_ports {pc_o[27]}]
set_load -pin_load 24.6946 [get_ports {pc_o[26]}]
set_load -pin_load 24.6946 [get_ports {pc_o[25]}]
set_load -pin_load 24.6946 [get_ports {pc_o[24]}]
set_load -pin_load 24.6946 [get_ports {pc_o[23]}]
set_load -pin_load 24.6946 [get_ports {pc_o[22]}]
set_load -pin_load 24.6946 [get_ports {pc_o[21]}]
set_load -pin_load 24.6946 [get_ports {pc_o[20]}]
set_load -pin_load 24.6946 [get_ports {pc_o[19]}]
set_load -pin_load 24.6946 [get_ports {pc_o[18]}]
set_load -pin_load 24.6946 [get_ports {pc_o[17]}]
set_load -pin_load 24.6946 [get_ports {pc_o[16]}]
set_load -pin_load 24.6946 [get_ports {pc_o[15]}]
set_load -pin_load 24.6946 [get_ports {pc_o[14]}]
set_load -pin_load 24.6946 [get_ports {pc_o[13]}]
set_load -pin_load 24.6946 [get_ports {pc_o[12]}]
set_load -pin_load 24.6946 [get_ports {pc_o[11]}]
set_load -pin_load 24.6946 [get_ports {pc_o[10]}]
set_load -pin_load 24.6946 [get_ports {pc_o[9]}]
set_load -pin_load 24.6946 [get_ports {pc_o[8]}]
set_load -pin_load 24.6946 [get_ports {pc_o[7]}]
set_load -pin_load 24.6946 [get_ports {pc_o[6]}]
set_load -pin_load 24.6946 [get_ports {pc_o[5]}]
set_load -pin_load 24.6946 [get_ports {pc_o[4]}]
set_load -pin_load 24.6946 [get_ports {pc_o[3]}]
set_load -pin_load 24.6946 [get_ports {pc_o[2]}]
set_load -pin_load 24.6946 [get_ports {pc_o[1]}]
set_load -pin_load 24.6946 [get_ports {pc_o[0]}]
set_load -pin_load 24.6946 [get_ports {inst_o[31]}]
set_load -pin_load 24.6946 [get_ports {inst_o[30]}]
set_load -pin_load 24.6946 [get_ports {inst_o[29]}]
set_load -pin_load 24.6946 [get_ports {inst_o[28]}]
set_load -pin_load 24.6946 [get_ports {inst_o[27]}]
set_load -pin_load 24.6946 [get_ports {inst_o[26]}]
set_load -pin_load 24.6946 [get_ports {inst_o[25]}]
set_load -pin_load 24.6946 [get_ports {inst_o[24]}]
set_load -pin_load 24.6946 [get_ports {inst_o[23]}]
set_load -pin_load 24.6946 [get_ports {inst_o[22]}]
set_load -pin_load 24.6946 [get_ports {inst_o[21]}]
set_load -pin_load 24.6946 [get_ports {inst_o[20]}]
set_load -pin_load 24.6946 [get_ports {inst_o[19]}]
set_load -pin_load 24.6946 [get_ports {inst_o[18]}]
set_load -pin_load 24.6946 [get_ports {inst_o[17]}]
set_load -pin_load 24.6946 [get_ports {inst_o[16]}]
set_load -pin_load 24.6946 [get_ports {inst_o[15]}]
set_load -pin_load 24.6946 [get_ports {inst_o[14]}]
set_load -pin_load 24.6946 [get_ports {inst_o[13]}]
set_load -pin_load 24.6946 [get_ports {inst_o[12]}]
set_load -pin_load 24.6946 [get_ports {inst_o[11]}]
set_load -pin_load 24.6946 [get_ports {inst_o[10]}]
set_load -pin_load 24.6946 [get_ports {inst_o[9]}]
set_load -pin_load 24.6946 [get_ports {inst_o[8]}]
set_load -pin_load 24.6946 [get_ports {inst_o[7]}]
set_load -pin_load 24.6946 [get_ports {inst_o[6]}]
set_load -pin_load 24.6946 [get_ports {inst_o[5]}]
set_load -pin_load 24.6946 [get_ports {inst_o[4]}]
set_load -pin_load 24.6946 [get_ports {inst_o[3]}]
set_load -pin_load 24.6946 [get_ports {inst_o[2]}]
set_load -pin_load 24.6946 [get_ports {inst_o[1]}]
set_load -pin_load 24.6946 [get_ports {inst_o[0]}]
set_load -pin_load 24.6946 [get_ports inst_valid_o]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[7]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[6]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[5]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[4]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[3]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[2]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[1]}]
set_load -pin_load 24.6946 [get_ports {imem_addr_o[0]}]
set_ideal_network -no_propagate  [get_ports reset_i]
set_timing_derate -late -net_delay 1 
set_timing_derate -early -net_delay 0.8 
set_timing_derate -late -cell_delay 1 
set_timing_derate -early -cell_delay 0.8 
create_clock [get_ports clk_i]  -period 10  -waveform {0 5}
set_clock_uncertainty -setup 0.05  [get_clocks clk_i]
set_clock_uncertainty -hold 0.01  [get_clocks clk_i]
set_clock_transition -min -fall 0.05 [get_clocks clk_i]
set_clock_transition -min -rise 0.05 [get_clocks clk_i]
set_clock_transition -max -fall 0.05 [get_clocks clk_i]
set_clock_transition -max -rise 0.05 [get_clocks clk_i]
group_path -name Feedthroughs  -from [list [get_ports reset_i] [get_ports stall_i] [get_ports pc_sel_i] [get_ports {br_dest[31]}] [get_ports {br_dest[30]}] [get_ports {br_dest[29]}] [get_ports {br_dest[28]}] [get_ports {br_dest[27]}] [get_ports {br_dest[26]}] [get_ports {br_dest[25]}] [get_ports {br_dest[24]}] [get_ports {br_dest[23]}] [get_ports {br_dest[22]}] [get_ports {br_dest[21]}] [get_ports {br_dest[20]}] [get_ports {br_dest[19]}] [get_ports {br_dest[18]}] [get_ports {br_dest[17]}] [get_ports {br_dest[16]}] [get_ports {br_dest[15]}] [get_ports {br_dest[14]}] [get_ports {br_dest[13]}] [get_ports {br_dest[12]}] [get_ports {br_dest[11]}] [get_ports {br_dest[10]}] [get_ports {br_dest[9]}] [get_ports {br_dest[8]}] [get_ports {br_dest[7]}] [get_ports {br_dest[6]}] [get_ports {br_dest[5]}] [get_ports {br_dest[4]}] [get_ports {br_dest[3]}] [get_ports {br_dest[2]}] [get_ports {br_dest[1]}] [get_ports {br_dest[0]}] [get_ports {imem_inst_i[31]}] [get_ports {imem_inst_i[30]}] [get_ports {imem_inst_i[29]}] [get_ports {imem_inst_i[28]}] [get_ports {imem_inst_i[27]}] [get_ports {imem_inst_i[26]}] [get_ports {imem_inst_i[25]}] [get_ports {imem_inst_i[24]}] [get_ports {imem_inst_i[23]}] [get_ports {imem_inst_i[22]}] [get_ports {imem_inst_i[21]}] [get_ports {imem_inst_i[20]}] [get_ports {imem_inst_i[19]}] [get_ports {imem_inst_i[18]}] [get_ports {imem_inst_i[17]}] [get_ports {imem_inst_i[16]}] [get_ports {imem_inst_i[15]}] [get_ports {imem_inst_i[14]}] [get_ports {imem_inst_i[13]}] [get_ports {imem_inst_i[12]}] [get_ports {imem_inst_i[11]}] [get_ports {imem_inst_i[10]}] [get_ports {imem_inst_i[9]}] [get_ports {imem_inst_i[8]}] [get_ports {imem_inst_i[7]}] [get_ports {imem_inst_i[6]}] [get_ports {imem_inst_i[5]}] [get_ports {imem_inst_i[4]}] [get_ports {imem_inst_i[3]}] [get_ports {imem_inst_i[2]}] [get_ports {imem_inst_i[1]}] [get_ports {imem_inst_i[0]}]]  -to [list [get_ports {pc_o[31]}] [get_ports {pc_o[30]}] [get_ports {pc_o[29]}] [get_ports {pc_o[28]}] [get_ports {pc_o[27]}] [get_ports {pc_o[26]}] [get_ports {pc_o[25]}] [get_ports {pc_o[24]}] [get_ports {pc_o[23]}] [get_ports {pc_o[22]}] [get_ports {pc_o[21]}] [get_ports {pc_o[20]}] [get_ports {pc_o[19]}] [get_ports {pc_o[18]}] [get_ports {pc_o[17]}] [get_ports {pc_o[16]}] [get_ports {pc_o[15]}] [get_ports {pc_o[14]}] [get_ports {pc_o[13]}] [get_ports {pc_o[12]}] [get_ports {pc_o[11]}] [get_ports {pc_o[10]}] [get_ports {pc_o[9]}] [get_ports {pc_o[8]}] [get_ports {pc_o[7]}] [get_ports {pc_o[6]}] [get_ports {pc_o[5]}] [get_ports {pc_o[4]}] [get_ports {pc_o[3]}] [get_ports {pc_o[2]}] [get_ports {pc_o[1]}] [get_ports {pc_o[0]}] [get_ports {inst_o[31]}] [get_ports {inst_o[30]}] [get_ports {inst_o[29]}] [get_ports {inst_o[28]}] [get_ports {inst_o[27]}] [get_ports {inst_o[26]}] [get_ports {inst_o[25]}] [get_ports {inst_o[24]}] [get_ports {inst_o[23]}] [get_ports {inst_o[22]}] [get_ports {inst_o[21]}] [get_ports {inst_o[20]}] [get_ports {inst_o[19]}] [get_ports {inst_o[18]}] [get_ports {inst_o[17]}] [get_ports {inst_o[16]}] [get_ports {inst_o[15]}] [get_ports {inst_o[14]}] [get_ports {inst_o[13]}] [get_ports {inst_o[12]}] [get_ports {inst_o[11]}] [get_ports {inst_o[10]}] [get_ports {inst_o[9]}] [get_ports {inst_o[8]}] [get_ports {inst_o[7]}] [get_ports {inst_o[6]}] [get_ports {inst_o[5]}] [get_ports {inst_o[4]}] [get_ports {inst_o[3]}] [get_ports {inst_o[2]}] [get_ports {inst_o[1]}] [get_ports {inst_o[0]}] [get_ports inst_valid_o] [get_ports {imem_addr_o[7]}] [get_ports {imem_addr_o[6]}] [get_ports {imem_addr_o[5]}] [get_ports {imem_addr_o[4]}] [get_ports {imem_addr_o[3]}] [get_ports {imem_addr_o[2]}] [get_ports {imem_addr_o[1]}] [get_ports {imem_addr_o[0]}]]
group_path -name Inputs  -from [list [get_ports reset_i] [get_ports stall_i] [get_ports pc_sel_i] [get_ports {br_dest[31]}] [get_ports {br_dest[30]}] [get_ports {br_dest[29]}] [get_ports {br_dest[28]}] [get_ports {br_dest[27]}] [get_ports {br_dest[26]}] [get_ports {br_dest[25]}] [get_ports {br_dest[24]}] [get_ports {br_dest[23]}] [get_ports {br_dest[22]}] [get_ports {br_dest[21]}] [get_ports {br_dest[20]}] [get_ports {br_dest[19]}] [get_ports {br_dest[18]}] [get_ports {br_dest[17]}] [get_ports {br_dest[16]}] [get_ports {br_dest[15]}] [get_ports {br_dest[14]}] [get_ports {br_dest[13]}] [get_ports {br_dest[12]}] [get_ports {br_dest[11]}] [get_ports {br_dest[10]}] [get_ports {br_dest[9]}] [get_ports {br_dest[8]}] [get_ports {br_dest[7]}] [get_ports {br_dest[6]}] [get_ports {br_dest[5]}] [get_ports {br_dest[4]}] [get_ports {br_dest[3]}] [get_ports {br_dest[2]}] [get_ports {br_dest[1]}] [get_ports {br_dest[0]}] [get_ports {imem_inst_i[31]}] [get_ports {imem_inst_i[30]}] [get_ports {imem_inst_i[29]}] [get_ports {imem_inst_i[28]}] [get_ports {imem_inst_i[27]}] [get_ports {imem_inst_i[26]}] [get_ports {imem_inst_i[25]}] [get_ports {imem_inst_i[24]}] [get_ports {imem_inst_i[23]}] [get_ports {imem_inst_i[22]}] [get_ports {imem_inst_i[21]}] [get_ports {imem_inst_i[20]}] [get_ports {imem_inst_i[19]}] [get_ports {imem_inst_i[18]}] [get_ports {imem_inst_i[17]}] [get_ports {imem_inst_i[16]}] [get_ports {imem_inst_i[15]}] [get_ports {imem_inst_i[14]}] [get_ports {imem_inst_i[13]}] [get_ports {imem_inst_i[12]}] [get_ports {imem_inst_i[11]}] [get_ports {imem_inst_i[10]}] [get_ports {imem_inst_i[9]}] [get_ports {imem_inst_i[8]}] [get_ports {imem_inst_i[7]}] [get_ports {imem_inst_i[6]}] [get_ports {imem_inst_i[5]}] [get_ports {imem_inst_i[4]}] [get_ports {imem_inst_i[3]}] [get_ports {imem_inst_i[2]}] [get_ports {imem_inst_i[1]}] [get_ports {imem_inst_i[0]}]]
group_path -name Outputs  -to [list [get_ports {pc_o[31]}] [get_ports {pc_o[30]}] [get_ports {pc_o[29]}] [get_ports {pc_o[28]}] [get_ports {pc_o[27]}] [get_ports {pc_o[26]}] [get_ports {pc_o[25]}] [get_ports {pc_o[24]}] [get_ports {pc_o[23]}] [get_ports {pc_o[22]}] [get_ports {pc_o[21]}] [get_ports {pc_o[20]}] [get_ports {pc_o[19]}] [get_ports {pc_o[18]}] [get_ports {pc_o[17]}] [get_ports {pc_o[16]}] [get_ports {pc_o[15]}] [get_ports {pc_o[14]}] [get_ports {pc_o[13]}] [get_ports {pc_o[12]}] [get_ports {pc_o[11]}] [get_ports {pc_o[10]}] [get_ports {pc_o[9]}] [get_ports {pc_o[8]}] [get_ports {pc_o[7]}] [get_ports {pc_o[6]}] [get_ports {pc_o[5]}] [get_ports {pc_o[4]}] [get_ports {pc_o[3]}] [get_ports {pc_o[2]}] [get_ports {pc_o[1]}] [get_ports {pc_o[0]}] [get_ports {inst_o[31]}] [get_ports {inst_o[30]}] [get_ports {inst_o[29]}] [get_ports {inst_o[28]}] [get_ports {inst_o[27]}] [get_ports {inst_o[26]}] [get_ports {inst_o[25]}] [get_ports {inst_o[24]}] [get_ports {inst_o[23]}] [get_ports {inst_o[22]}] [get_ports {inst_o[21]}] [get_ports {inst_o[20]}] [get_ports {inst_o[19]}] [get_ports {inst_o[18]}] [get_ports {inst_o[17]}] [get_ports {inst_o[16]}] [get_ports {inst_o[15]}] [get_ports {inst_o[14]}] [get_ports {inst_o[13]}] [get_ports {inst_o[12]}] [get_ports {inst_o[11]}] [get_ports {inst_o[10]}] [get_ports {inst_o[9]}] [get_ports {inst_o[8]}] [get_ports {inst_o[7]}] [get_ports {inst_o[6]}] [get_ports {inst_o[5]}] [get_ports {inst_o[4]}] [get_ports {inst_o[3]}] [get_ports {inst_o[2]}] [get_ports {inst_o[1]}] [get_ports {inst_o[0]}] [get_ports inst_valid_o] [get_ports {imem_addr_o[7]}] [get_ports {imem_addr_o[6]}] [get_ports {imem_addr_o[5]}] [get_ports {imem_addr_o[4]}] [get_ports {imem_addr_o[3]}] [get_ports {imem_addr_o[2]}] [get_ports {imem_addr_o[1]}] [get_ports {imem_addr_o[0]}]]
group_path -name Regs_to_Regs  -from [list [get_cells pc_reg_0_] [get_cells pc_reg_1_] [get_cells pc_reg_2_] [get_cells pc_reg_3_] [get_cells pc_reg_4_] [get_cells pc_reg_5_] [get_cells pc_reg_6_] [get_cells pc_reg_7_] [get_cells pc_reg_8_] [get_cells pc_reg_9_] [get_cells pc_reg_10_] [get_cells pc_reg_11_] [get_cells pc_reg_12_] [get_cells pc_reg_13_] [get_cells pc_reg_14_] [get_cells pc_reg_15_] [get_cells pc_reg_16_] [get_cells pc_reg_17_] [get_cells pc_reg_18_] [get_cells pc_reg_19_] [get_cells pc_reg_20_] [get_cells pc_reg_21_] [get_cells pc_reg_22_] [get_cells pc_reg_23_] [get_cells pc_reg_24_] [get_cells pc_reg_25_] [get_cells pc_reg_26_] [get_cells pc_reg_27_] [get_cells pc_reg_28_] [get_cells pc_reg_29_] [get_cells pc_reg_30_] [get_cells pc_reg_31_] [get_cells inst_valid_reg_0_] [get_cells inst_o_reg_0_] [get_cells inst_o_reg_1_] [get_cells inst_o_reg_2_] [get_cells inst_o_reg_3_] [get_cells inst_o_reg_4_] [get_cells inst_o_reg_5_] [get_cells inst_o_reg_6_] [get_cells inst_o_reg_7_] [get_cells inst_o_reg_8_] [get_cells inst_o_reg_9_] [get_cells inst_o_reg_10_] [get_cells inst_o_reg_11_] [get_cells inst_o_reg_12_] [get_cells inst_o_reg_13_] [get_cells inst_o_reg_14_] [get_cells inst_o_reg_15_] [get_cells inst_o_reg_16_] [get_cells inst_o_reg_17_] [get_cells inst_o_reg_18_] [get_cells inst_o_reg_19_] [get_cells inst_o_reg_20_] [get_cells inst_o_reg_21_] [get_cells inst_o_reg_22_] [get_cells inst_o_reg_23_] [get_cells inst_o_reg_24_] [get_cells inst_o_reg_25_] [get_cells inst_o_reg_26_] [get_cells inst_o_reg_27_] [get_cells inst_o_reg_28_] [get_cells inst_o_reg_29_] [get_cells inst_o_reg_30_] [get_cells inst_o_reg_31_] [get_cells pc_o_reg_0_] [get_cells pc_o_reg_1_] [get_cells pc_o_reg_2_] [get_cells pc_o_reg_3_] [get_cells pc_o_reg_4_] [get_cells pc_o_reg_5_] [get_cells pc_o_reg_6_] [get_cells pc_o_reg_7_] [get_cells pc_o_reg_8_] [get_cells pc_o_reg_9_] [get_cells pc_o_reg_10_] [get_cells pc_o_reg_11_] [get_cells pc_o_reg_12_] [get_cells pc_o_reg_13_] [get_cells pc_o_reg_14_] [get_cells pc_o_reg_15_] [get_cells pc_o_reg_16_] [get_cells pc_o_reg_17_] [get_cells pc_o_reg_18_] [get_cells pc_o_reg_19_] [get_cells pc_o_reg_20_] [get_cells pc_o_reg_21_] [get_cells pc_o_reg_22_] [get_cells pc_o_reg_23_] [get_cells pc_o_reg_24_] [get_cells pc_o_reg_25_] [get_cells pc_o_reg_26_] [get_cells pc_o_reg_27_] [get_cells pc_o_reg_28_] [get_cells pc_o_reg_29_] [get_cells pc_o_reg_30_] [get_cells pc_o_reg_31_] [get_cells inst_valid_o_reg]]  -to [list [get_cells pc_reg_0_] [get_cells pc_reg_1_] [get_cells pc_reg_2_] [get_cells pc_reg_3_] [get_cells pc_reg_4_] [get_cells pc_reg_5_] [get_cells pc_reg_6_] [get_cells pc_reg_7_] [get_cells pc_reg_8_] [get_cells pc_reg_9_] [get_cells pc_reg_10_] [get_cells pc_reg_11_] [get_cells pc_reg_12_] [get_cells pc_reg_13_] [get_cells pc_reg_14_] [get_cells pc_reg_15_] [get_cells pc_reg_16_] [get_cells pc_reg_17_] [get_cells pc_reg_18_] [get_cells pc_reg_19_] [get_cells pc_reg_20_] [get_cells pc_reg_21_] [get_cells pc_reg_22_] [get_cells pc_reg_23_] [get_cells pc_reg_24_] [get_cells pc_reg_25_] [get_cells pc_reg_26_] [get_cells pc_reg_27_] [get_cells pc_reg_28_] [get_cells pc_reg_29_] [get_cells pc_reg_30_] [get_cells pc_reg_31_] [get_cells inst_valid_reg_0_] [get_cells inst_o_reg_0_] [get_cells inst_o_reg_1_] [get_cells inst_o_reg_2_] [get_cells inst_o_reg_3_] [get_cells inst_o_reg_4_] [get_cells inst_o_reg_5_] [get_cells inst_o_reg_6_] [get_cells inst_o_reg_7_] [get_cells inst_o_reg_8_] [get_cells inst_o_reg_9_] [get_cells inst_o_reg_10_] [get_cells inst_o_reg_11_] [get_cells inst_o_reg_12_] [get_cells inst_o_reg_13_] [get_cells inst_o_reg_14_] [get_cells inst_o_reg_15_] [get_cells inst_o_reg_16_] [get_cells inst_o_reg_17_] [get_cells inst_o_reg_18_] [get_cells inst_o_reg_19_] [get_cells inst_o_reg_20_] [get_cells inst_o_reg_21_] [get_cells inst_o_reg_22_] [get_cells inst_o_reg_23_] [get_cells inst_o_reg_24_] [get_cells inst_o_reg_25_] [get_cells inst_o_reg_26_] [get_cells inst_o_reg_27_] [get_cells inst_o_reg_28_] [get_cells inst_o_reg_29_] [get_cells inst_o_reg_30_] [get_cells inst_o_reg_31_] [get_cells pc_o_reg_0_] [get_cells pc_o_reg_1_] [get_cells pc_o_reg_2_] [get_cells pc_o_reg_3_] [get_cells pc_o_reg_4_] [get_cells pc_o_reg_5_] [get_cells pc_o_reg_6_] [get_cells pc_o_reg_7_] [get_cells pc_o_reg_8_] [get_cells pc_o_reg_9_] [get_cells pc_o_reg_10_] [get_cells pc_o_reg_11_] [get_cells pc_o_reg_12_] [get_cells pc_o_reg_13_] [get_cells pc_o_reg_14_] [get_cells pc_o_reg_15_] [get_cells pc_o_reg_16_] [get_cells pc_o_reg_17_] [get_cells pc_o_reg_18_] [get_cells pc_o_reg_19_] [get_cells pc_o_reg_20_] [get_cells pc_o_reg_21_] [get_cells pc_o_reg_22_] [get_cells pc_o_reg_23_] [get_cells pc_o_reg_24_] [get_cells pc_o_reg_25_] [get_cells pc_o_reg_26_] [get_cells pc_o_reg_27_] [get_cells pc_o_reg_28_] [get_cells pc_o_reg_29_] [get_cells pc_o_reg_30_] [get_cells pc_o_reg_31_] [get_cells inst_valid_o_reg]]
set_input_delay -clock clk_i  0.1  [get_ports reset_i]
set_input_delay -clock clk_i  0.1  [get_ports stall_i]
set_input_delay -clock clk_i  0.1  [get_ports pc_sel_i]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[31]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[30]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[29]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[28]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[27]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[26]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[25]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[24]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[23]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[22]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[21]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[20]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[19]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[18]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[17]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[16]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[15]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[14]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[13]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[12]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[11]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[10]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[9]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[8]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[7]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[6]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[5]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[4]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[3]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[2]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[1]}]
set_input_delay -clock clk_i  0.1  [get_ports {br_dest[0]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[31]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[30]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[29]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[28]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[27]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[26]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[25]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[24]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[23]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[22]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[21]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[20]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[19]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[18]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[17]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[16]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[15]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[14]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[13]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[12]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[11]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[10]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[9]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[8]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[7]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[6]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[5]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[4]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[3]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[2]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[1]}]
set_input_delay -clock clk_i  0.1  [get_ports {imem_inst_i[0]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[31]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[30]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[29]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[28]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[27]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[26]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[25]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[24]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[23]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[22]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[21]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[20]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[19]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[18]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[17]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[16]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[15]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[14]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[13]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[12]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[11]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[10]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[9]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[8]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[7]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[6]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[5]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[4]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[3]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[2]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[1]}]
set_output_delay -clock clk_i  0.1  [get_ports {pc_o[0]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[31]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[30]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[29]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[28]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[27]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[26]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[25]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[24]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[23]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[22]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[21]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[20]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[19]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[18]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[17]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[16]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[15]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[14]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[13]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[12]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[11]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[10]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[9]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[8]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[7]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[6]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[5]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[4]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[3]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[2]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[1]}]
set_output_delay -clock clk_i  0.1  [get_ports {inst_o[0]}]
set_output_delay -clock clk_i  0.1  [get_ports inst_valid_o]
set_output_delay -clock clk_i  0.1  [get_ports {imem_addr_o[7]}]
set_output_delay -clock clk_i  0.1  [get_ports {imem_addr_o[6]}]
set_output_delay -clock clk_i  0.1  [get_ports {imem_addr_o[5]}]
set_output_delay -clock clk_i  0.1  [get_ports {imem_addr_o[4]}]
set_output_delay -clock clk_i  0.1  [get_ports {imem_addr_o[3]}]
set_output_delay -clock clk_i  0.1  [get_ports {imem_addr_o[2]}]
set_output_delay -clock clk_i  0.1  [get_ports {imem_addr_o[1]}]
set_output_delay -clock clk_i  0.1  [get_ports {imem_addr_o[0]}]
set_drive 0.00865463  [get_ports clk_i]
set_drive 0.00865463  [get_ports reset_i]
set_drive 0.00865463  [get_ports stall_i]
set_drive 0.00865463  [get_ports pc_sel_i]
set_drive 0.00865463  [get_ports {br_dest[31]}]
set_drive 0.00865463  [get_ports {br_dest[30]}]
set_drive 0.00865463  [get_ports {br_dest[29]}]
set_drive 0.00865463  [get_ports {br_dest[28]}]
set_drive 0.00865463  [get_ports {br_dest[27]}]
set_drive 0.00865463  [get_ports {br_dest[26]}]
set_drive 0.00865463  [get_ports {br_dest[25]}]
set_drive 0.00865463  [get_ports {br_dest[24]}]
set_drive 0.00865463  [get_ports {br_dest[23]}]
set_drive 0.00865463  [get_ports {br_dest[22]}]
set_drive 0.00865463  [get_ports {br_dest[21]}]
set_drive 0.00865463  [get_ports {br_dest[20]}]
set_drive 0.00865463  [get_ports {br_dest[19]}]
set_drive 0.00865463  [get_ports {br_dest[18]}]
set_drive 0.00865463  [get_ports {br_dest[17]}]
set_drive 0.00865463  [get_ports {br_dest[16]}]
set_drive 0.00865463  [get_ports {br_dest[15]}]
set_drive 0.00865463  [get_ports {br_dest[14]}]
set_drive 0.00865463  [get_ports {br_dest[13]}]
set_drive 0.00865463  [get_ports {br_dest[12]}]
set_drive 0.00865463  [get_ports {br_dest[11]}]
set_drive 0.00865463  [get_ports {br_dest[10]}]
set_drive 0.00865463  [get_ports {br_dest[9]}]
set_drive 0.00865463  [get_ports {br_dest[8]}]
set_drive 0.00865463  [get_ports {br_dest[7]}]
set_drive 0.00865463  [get_ports {br_dest[6]}]
set_drive 0.00865463  [get_ports {br_dest[5]}]
set_drive 0.00865463  [get_ports {br_dest[4]}]
set_drive 0.00865463  [get_ports {br_dest[3]}]
set_drive 0.00865463  [get_ports {br_dest[2]}]
set_drive 0.00865463  [get_ports {br_dest[1]}]
set_drive 0.00865463  [get_ports {br_dest[0]}]
set_drive 0.00865463  [get_ports {imem_inst_i[31]}]
set_drive 0.00865463  [get_ports {imem_inst_i[30]}]
set_drive 0.00865463  [get_ports {imem_inst_i[29]}]
set_drive 0.00865463  [get_ports {imem_inst_i[28]}]
set_drive 0.00865463  [get_ports {imem_inst_i[27]}]
set_drive 0.00865463  [get_ports {imem_inst_i[26]}]
set_drive 0.00865463  [get_ports {imem_inst_i[25]}]
set_drive 0.00865463  [get_ports {imem_inst_i[24]}]
set_drive 0.00865463  [get_ports {imem_inst_i[23]}]
set_drive 0.00865463  [get_ports {imem_inst_i[22]}]
set_drive 0.00865463  [get_ports {imem_inst_i[21]}]
set_drive 0.00865463  [get_ports {imem_inst_i[20]}]
set_drive 0.00865463  [get_ports {imem_inst_i[19]}]
set_drive 0.00865463  [get_ports {imem_inst_i[18]}]
set_drive 0.00865463  [get_ports {imem_inst_i[17]}]
set_drive 0.00865463  [get_ports {imem_inst_i[16]}]
set_drive 0.00865463  [get_ports {imem_inst_i[15]}]
set_drive 0.00865463  [get_ports {imem_inst_i[14]}]
set_drive 0.00865463  [get_ports {imem_inst_i[13]}]
set_drive 0.00865463  [get_ports {imem_inst_i[12]}]
set_drive 0.00865463  [get_ports {imem_inst_i[11]}]
set_drive 0.00865463  [get_ports {imem_inst_i[10]}]
set_drive 0.00865463  [get_ports {imem_inst_i[9]}]
set_drive 0.00865463  [get_ports {imem_inst_i[8]}]
set_drive 0.00865463  [get_ports {imem_inst_i[7]}]
set_drive 0.00865463  [get_ports {imem_inst_i[6]}]
set_drive 0.00865463  [get_ports {imem_inst_i[5]}]
set_drive 0.00865463  [get_ports {imem_inst_i[4]}]
set_drive 0.00865463  [get_ports {imem_inst_i[3]}]
set_drive 0.00865463  [get_ports {imem_inst_i[2]}]
set_drive 0.00865463  [get_ports {imem_inst_i[1]}]
set_drive 0.00865463  [get_ports {imem_inst_i[0]}]
